{
  "title": "Skills.sh Feed",
  "description": "Latest skill data from skills.sh",
  "link": "https://skills.sh",
  "updatedAt": "2026-02-21T13:01:14.270Z",
  "providers": [
    {
      "id": "skills.sh",
      "name": "skills.sh",
      "link": "https://skills.sh"
    }
  ],
  "topAllTime": [
    {
      "id": "vercel-labs/skills/find-skills",
      "title": "find-skills",
      "source": "vercel-labs/skills",
      "installs": 282223,
      "link": "https://skills.sh/vercel-labs/skills/find-skills",
      "providerId": "skills.sh",
      "description": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-best-practices",
      "title": "vercel-react-best-practices",
      "source": "vercel-labs/agent-skills",
      "installs": 153276,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-best-practices",
      "providerId": "skills.sh",
      "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
    },
    {
      "id": "vercel-labs/agent-skills/web-design-guidelines",
      "title": "web-design-guidelines",
      "source": "vercel-labs/agent-skills",
      "installs": 116126,
      "link": "https://skills.sh/vercel-labs/agent-skills/web-design-guidelines",
      "providerId": "skills.sh",
      "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
    },
    {
      "id": "remotion-dev/skills/remotion-best-practices",
      "title": "remotion-best-practices",
      "source": "remotion-dev/skills",
      "installs": 102593,
      "link": "https://skills.sh/remotion-dev/skills/remotion-best-practices",
      "providerId": "skills.sh",
      "description": "Best practices for Remotion - Video creation in React"
    },
    {
      "id": "anthropics/skills/frontend-design",
      "title": "frontend-design",
      "source": "anthropics/skills",
      "installs": 86374,
      "link": "https://skills.sh/anthropics/skills/frontend-design",
      "providerId": "skills.sh",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-composition-patterns",
      "title": "vercel-composition-patterns",
      "source": "vercel-labs/agent-skills",
      "installs": 50446,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-composition-patterns",
      "providerId": "skills.sh",
      "description": "React composition patterns that scale. Use when refactoring components with boolean prop proliferation, building flexible component libraries, or designing reusable APIs. Triggers on tasks involving compound components, render props, context providers, or component architecture."
    },
    {
      "id": "vercel-labs/agent-browser/agent-browser",
      "title": "agent-browser",
      "source": "vercel-labs/agent-browser",
      "installs": 50236,
      "link": "https://skills.sh/vercel-labs/agent-browser/agent-browser",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, test web applications, or extract information from web pages."
    },
    {
      "id": "anthropics/skills/skill-creator",
      "title": "skill-creator",
      "source": "anthropics/skills",
      "installs": 41923,
      "link": "https://skills.sh/anthropics/skills/skill-creator",
      "providerId": "skills.sh",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-native-skills",
      "title": "vercel-react-native-skills",
      "source": "vercel-labs/agent-skills",
      "installs": 35702,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-native-skills",
      "providerId": "skills.sh",
      "description": "React Native and Expo best practices for building performant mobile apps. Use when building React Native components, optimizing list performance, implementing animations, or working with native modules. Triggers on tasks involving React Native, Expo, mobile performance, or native platform APIs."
    },
    {
      "id": "browser-use/browser-use/browser-use",
      "title": "browser-use",
      "source": "browser-use/browser-use",
      "installs": 35419,
      "link": "https://skills.sh/browser-use/browser-use/browser-use",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, or extract information from web pages."
    },
    {
      "id": "nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "title": "ui-ux-pro-max",
      "source": "nextlevelbuilder/ui-ux-pro-max-skill",
      "installs": 33176,
      "link": "https://skills.sh/nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "providerId": "skills.sh",
      "description": "UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, create, design, implement, review, fix, improve, optimize, enhance, refactor, check UI/UX code. Projects: website, landing page, dashboard, admin panel, e-commerce, SaaS, portfolio, blog, mobile app, .html, .tsx, .vue, .svelte. Elements: button, modal, navbar, sidebar, card, table, form, chart. Styles: glassmorphism, claymorphism, minimalism, brutalism, neumorphism, bento grid, dark mode, responsive, skeuomorphism, flat design. Topics: color palette, accessibility, animation, layout, typography, font pairing, spacing, hover, shadow, gradient. Integrations: shadcn/ui MCP for component search and examples."
    },
    {
      "id": "obra/superpowers/brainstorming",
      "title": "brainstorming",
      "source": "obra/superpowers",
      "installs": 25781,
      "link": "https://skills.sh/obra/superpowers/brainstorming",
      "providerId": "skills.sh",
      "description": "You MUST use this before any creative work - creating features, building components, adding functionality, or modifying behavior. Explores user intent, requirements and design before implementation."
    },
    {
      "id": "coreyhaines31/marketingskills/seo-audit",
      "title": "seo-audit",
      "source": "coreyhaines31/marketingskills",
      "installs": 23423,
      "link": "https://skills.sh/coreyhaines31/marketingskills/seo-audit",
      "providerId": "skills.sh",
      "description": "When the user wants to audit, review, or diagnose SEO issues on their site. Also use when the user mentions \"SEO audit,\" \"technical SEO,\" \"why am I not ranking,\" \"SEO issues,\" \"on-page SEO,\" \"meta tags review,\" or \"SEO health check.\" For building pages at scale to target keywords, see programmatic-seo. For adding structured data, see schema-markup."
    },
    {
      "id": "squirrelscan/skills/audit-website",
      "title": "audit-website",
      "source": "squirrelscan/skills",
      "installs": 23383,
      "link": "https://skills.sh/squirrelscan/skills/audit-website",
      "providerId": "skills.sh",
      "description": "Audit websites for SEO, performance, security, technical, content, and 15 other issue cateories with 150+ rules using the squirrelscan CLI. Returns LLM-optimized reports with health scores, broken links, meta tag analysis, and actionable recommendations. Use to discover and asses website or webapp issues and health."
    },
    {
      "id": "supabase/agent-skills/supabase-postgres-best-practices",
      "title": "supabase-postgres-best-practices",
      "source": "supabase/agent-skills",
      "installs": 21720,
      "link": "https://skills.sh/supabase/agent-skills/supabase-postgres-best-practices",
      "providerId": "skills.sh",
      "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations."
    },
    {
      "id": "anthropics/skills/pdf",
      "title": "pdf",
      "source": "anthropics/skills",
      "installs": 18249,
      "link": "https://skills.sh/anthropics/skills/pdf",
      "providerId": "skills.sh",
      "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale."
    },
    {
      "id": "coreyhaines31/marketingskills/copywriting",
      "title": "copywriting",
      "source": "coreyhaines31/marketingskills",
      "installs": 17550,
      "link": "https://skills.sh/coreyhaines31/marketingskills/copywriting",
      "providerId": "skills.sh",
      "description": "When the user wants to write, rewrite, or improve marketing copy for any page — including homepage, landing pages, pricing pages, feature pages, about pages, or product pages. Also use when the user says \"write copy for,\" \"improve this copy,\" \"rewrite this page,\" \"marketing copy,\" \"headline help,\" or \"CTA copy.\" For email copy, see email-sequence. For popup copy, see popup-cro."
    },
    {
      "id": "vercel-labs/next-skills/next-best-practices",
      "title": "next-best-practices",
      "source": "vercel-labs/next-skills",
      "installs": 17062,
      "link": "https://skills.sh/vercel-labs/next-skills/next-best-practices",
      "providerId": "skills.sh",
      "description": "Next.js best practices - file conventions, RSC boundaries, data patterns, async APIs, metadata, error handling, route handlers, image/font optimization, bundling"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-observability",
      "title": "azure-observability",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16925,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-observability",
      "providerId": "skills.sh",
      "description": "Azure Observability Services including Azure Monitor, Application Insights, Log Analytics, Alerts, and Workbooks. Provides metrics, APM, distributed tracing, KQL queries, and interactive reports."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-storage",
      "title": "azure-storage",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16922,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-storage",
      "providerId": "skills.sh",
      "description": "Azure Storage Services including Blob Storage, File Shares, Queue Storage, Table Storage, and Data Lake. Provides object storage, SMB file shares, async messaging, NoSQL key-value, and big data analytics capabilities. Includes access tiers (hot, cool, archive) and lifecycle management."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-diagnostics",
      "title": "azure-diagnostics",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16917,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-diagnostics",
      "providerId": "skills.sh",
      "description": "Debug and troubleshoot production issues on Azure. Covers Container Apps diagnostics, log analysis with KQL, health checks, and common issue resolution for image pulls, cold starts, and health probes.\nUSE FOR: debug production issues, troubleshoot container apps, analyze logs with KQL, fix image pull failures, resolve cold start issues, investigate health probe failures, check resource health, view application logs, find root cause of errors\nDO NOT USE FOR: deploying applications (use azure-deploy), creating new resources (use azure-prepare), setting up monitoring (use azure-observability), cost optimization (use azure-cost-optimization)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-cost-optimization",
      "title": "azure-cost-optimization",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16915,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-cost-optimization",
      "providerId": "skills.sh",
      "description": "Identify and quantify cost savings across Azure subscriptions by analyzing actual costs,\nutilization metrics, and generating actionable optimization recommendations. USE FOR:\noptimize Azure costs, reduce Azure spending, reduce Azure expenses, analyze Azure costs,\nfind cost savings, generate cost optimization report, find orphaned resources, rightsize VMs,\ncost analysis, reduce waste, Azure spending analysis, find unused resources, optimize Redis\ncosts. DO NOT USE FOR: deploying resources (use azure-deploy), general Azure diagnostics\n(use azure-diagnostics), security issues (use azure-security)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-kusto",
      "title": "azure-kusto",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16914,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-kusto",
      "providerId": "skills.sh",
      "description": "Query and analyze data in Azure Data Explorer (Kusto/ADX) using KQL for log analytics, telemetry, and time series analysis.\nUSE FOR: KQL queries, Kusto database queries, Azure Data Explorer, ADX clusters, log analytics, time series data, IoT telemetry, anomaly detection\nDO NOT USE FOR: SQL databases (use azure-postgres), NoSQL queries (use azure-storage), Elasticsearch, AWS analytics tools"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-ai",
      "title": "azure-ai",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16913,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-ai",
      "providerId": "skills.sh",
      "description": "Use for Azure AI: Search, Speech, OpenAI, Document Intelligence. Helps with search, vector/hybrid search, speech-to-text, text-to-speech, transcription, OCR. USE FOR: AI Search, query search, vector search, hybrid search, semantic search, speech-to-text, text-to-speech, transcribe, OCR, convert text to speech. DO NOT USE FOR: Function apps/Functions (use azure-functions), databases (azure-postgres/azure-kusto), general Azure resources."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-deploy",
      "title": "azure-deploy",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16912,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-deploy",
      "providerId": "skills.sh",
      "description": "Execute deployment to Azure. Final step after preparation and validation. Runs azd up, azd deploy, or infrastructure provisioning commands.\nUSE FOR: run azd up, run azd deploy, execute deployment, provision infrastructure, push to production, go live, ship it, deploy web app, deploy container app, deploy static site, deploy Azure Functions, bicep deploy, terraform apply.\nDO NOT USE FOR: creating or building apps (use azure-prepare), validating before deploy (use azure-validate)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "title": "azure-resource-visualizer",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16909,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "providerId": "skills.sh",
      "description": "Analyze Azure resource groups and generate detailed Mermaid architecture diagrams showing the relationships between individual resources.\nUSE FOR: create architecture diagram, visualize Azure resources, show resource relationships, generate Mermaid diagram, analyze resource group, diagram my resources, architecture visualization, resource topology, map Azure infrastructure\nDO NOT USE FOR: creating/modifying resources (use azure-deploy), security scanning (use azure-security), performance troubleshooting (use azure-diagnostics), code generation (use relevant service skill)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/entra-app-registration",
      "title": "entra-app-registration",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16908,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/entra-app-registration",
      "providerId": "skills.sh",
      "description": "Guides Microsoft Entra ID app registration, OAuth 2.0 authentication, and MSAL integration.\nUSE FOR: create app registration, register Azure AD app, configure OAuth, set up authentication, add API permissions, generate service principal, MSAL example, console app auth, Entra ID setup, Azure AD authentication.\nDO NOT USE FOR: Azure RBAC or role assignments (use azure-rbac), Key Vault secrets (use azure-keyvault-expiration-audit), Azure resource security (use azure-security)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-postgres",
      "title": "azure-postgres",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16907,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-postgres",
      "providerId": "skills.sh",
      "description": "Create new Azure Database for PostgreSQL Flexible Server instances and configure passwordless authentication with Microsoft Entra ID. Set up developer access, managed identities for apps, group-based permissions, and migrate from password-based to Entra ID authentication. Trigger phrases include \"passwordless for postgres\", \"entra id postgres\", \"azure ad postgres authentication\", \"postgres managed identity\", \"migrate postgres to passwordless\"."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-validate",
      "title": "azure-validate",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16906,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-validate",
      "providerId": "skills.sh",
      "description": "Pre-deployment validation checkpoint. Run deep checks to ensure your application is ready for Azure deployment. Validates configuration, infrastructure, permissions, and prerequisites.\nUSE FOR: validate my app, check deployment readiness, run preflight checks, verify configuration, check if ready to deploy, validate azure.yaml, validate Bicep, test before deploying, troubleshoot deployment errors.\nDO NOT USE FOR: creating or building apps (use azure-prepare), executing deployments (use azure-deploy)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/microsoft-foundry",
      "title": "microsoft-foundry",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16905,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/microsoft-foundry",
      "providerId": "skills.sh",
      "description": "Use this skill to work with Microsoft Foundry (Azure AI Foundry): deploy AI models from catalog, build RAG applications with knowledge indexes, create and evaluate AI agents, manage RBAC permissions and role assignments, manage quotas and capacity, create Foundry resources.\nUSE FOR: Microsoft Foundry, AI Foundry, deploy model, model catalog, RAG, knowledge index, create agent, evaluate agent, agent monitoring, create Foundry project, new Foundry project, set up Foundry, onboard to Foundry, provision Foundry infrastructure, create Foundry resource, create AI Services, multi-service resource, AIServices kind, register resource provider, enable Cognitive Services, setup AI Services account, create resource group for Foundry, RBAC, role assignment, managed identity, service principal, permissions, quota, capacity, TPM, deployment failure, QuotaExceeded.\nDO NOT USE FOR: Azure Functions (use azure-functions), App Service (use azure-create-app), generic Azure resource creation (use azure-create-app)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-prepare",
      "title": "azure-prepare",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16905,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-prepare",
      "providerId": "skills.sh",
      "description": "Default entry point for Azure application development. Invoke this skill for ANY application work related to Azure: creating apps, building features, adding components, updating code, migrating, or modernizing. Analyzes your project and prepares it for Azure deployment by generating infrastructure code (Bicep/Terraform), azure.yaml configuration, and Dockerfiles.\nUSE FOR: create an app, build a web app, create API, create frontend, create backend, add a feature, build a service, make an application, develop a project, migrate my app, modernize my code, update my application, add database, add authentication, add caching, deploy to Azure, host on Azure, Azure with Terraform (defaults to azd+Terraform), Azure with azd, generate azure.yaml, generate Bicep or Terraform, prepare Azure Functions.\nDO NOT USE FOR: only validating an already-prepared app (use azure-validate), only running azd up/deploy (use azure-deploy), pure Terraform without azd (prefer azd+Terraform)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "title": "appinsights-instrumentation",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16904,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "providerId": "skills.sh",
      "description": "Guidance for instrumenting webapps with Azure Application Insights. Provides telemetry patterns, SDK setup, and configuration references.\nUSE FOR: how to instrument app, App Insights SDK, telemetry patterns, what is App Insights, Application Insights guidance, instrumentation examples, APM best practices.\nDO NOT USE FOR: adding App Insights to my app (use azure-prepare), add telemetry to my project (use azure-prepare), add monitoring (use azure-prepare). This skill provides guidance—azure-prepare orchestrates component changes."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-compliance",
      "title": "azure-compliance",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16904,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-compliance",
      "providerId": "skills.sh",
      "description": "Comprehensive Azure compliance and security auditing capabilities including best practices assessment,\nKey Vault expiration monitoring, and resource configuration validation.\nUSE FOR: compliance scan, security audit, azqr, Azure best practices, Key Vault expiration check,\ncompliance assessment, resource review, configuration validation, expired certificates, expiring secrets,\norphaned resources, policy compliance, security posture evaluation.\nDO NOT USE FOR: deploying resources (use azure-deploy), cost analysis alone (use azure-cost-optimization),\nactive security hardening (use azure-security-hardening), general Azure Advisor queries (use azure-observability)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-aigateway",
      "title": "azure-aigateway",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16903,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-aigateway",
      "providerId": "skills.sh",
      "description": "Configure Azure API Management (APIM) as AI Gateway to secure, observe, control AI models, MCP servers, agents. Helps with rate limiting, semantic caching, content safety, load balancing.\nUSE FOR: AI Gateway, APIM, setup gateway, configure gateway, add gateway, model gateway, MCP server, rate limit, token limit, semantic cache, content safety, load balance, OpenAPI import, convert API to MCP.\nDO NOT USE FOR: deploy models (use microsoft-foundry), Azure Functions (use azure-functions), databases (use azure-postgres)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-rbac",
      "title": "azure-rbac",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16899,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-rbac",
      "providerId": "skills.sh",
      "description": "Helps users find the right Azure RBAC role for an identity with least privilege access, then generate CLI commands and Bicep code to assign it.\nUSE FOR: \"what role should I assign\", \"least privilege role\", \"RBAC role for\", \"role to read blobs\", \"role for managed identity\", \"custom role definition\", \"assign role to identity\".\nDO NOT USE FOR: creating or configuring managed identities, or general Azure security hardening; those are out of scope for this role-selection skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-lookup",
      "title": "azure-resource-lookup",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 16898,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-lookup",
      "providerId": "skills.sh",
      "description": "List, find, and show Azure resources. Answers \"list my VMs\", \"show my storage accounts\", \"list websites\",\n\"find container apps\", \"what resources do I have\", and similar queries for any Azure resource type.\nUSE FOR: list resources, list virtual machines, list VMs, list storage accounts, list websites, list web apps,\nlist container apps, show resources, find resources, what resources do I have, list resources in resource group,\nlist resources in subscription, find resources by tag, find orphaned resources, resource inventory,\ncount resources by type, cross-subscription resource query, Azure Resource Graph, resource discovery,\nlist container registries, list SQL servers, list Key Vaults, show resource groups, list app services,\nfind resources across subscriptions, find unattached disks, tag analysis.\nDO NOT USE FOR: deploying resources (use azure-deploy), creating or modifying resources,\ncost optimization (use azure-cost-optimization), writing application code, non-Azure clouds."
    },
    {
      "id": "anthropics/skills/pptx",
      "title": "pptx",
      "source": "anthropics/skills",
      "installs": 15023,
      "link": "https://skills.sh/anthropics/skills/pptx",
      "providerId": "skills.sh",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks"
    },
    {
      "id": "obra/superpowers/systematic-debugging",
      "title": "systematic-debugging",
      "source": "obra/superpowers",
      "installs": 14219,
      "link": "https://skills.sh/obra/superpowers/systematic-debugging",
      "providerId": "skills.sh",
      "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
    },
    {
      "id": "anthropics/skills/docx",
      "title": "docx",
      "source": "anthropics/skills",
      "installs": 13906,
      "link": "https://skills.sh/anthropics/skills/docx",
      "providerId": "skills.sh",
      "description": "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks"
    },
    {
      "id": "better-auth/skills/better-auth-best-practices",
      "title": "better-auth-best-practices",
      "source": "better-auth/skills",
      "installs": 13833,
      "link": "https://skills.sh/better-auth/skills/better-auth-best-practices",
      "providerId": "skills.sh",
      "description": "Skill for integrating Better Auth - the comprehensive TypeScript authentication framework."
    },
    {
      "id": "anthropics/skills/xlsx",
      "title": "xlsx",
      "source": "anthropics/skills",
      "installs": 13645,
      "link": "https://skills.sh/anthropics/skills/xlsx",
      "providerId": "skills.sh",
      "description": "Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data analysis and visualization in spreadsheets, or (5) Recalculating formulas"
    },
    {
      "id": "coreyhaines31/marketingskills/marketing-psychology",
      "title": "marketing-psychology",
      "source": "coreyhaines31/marketingskills",
      "installs": 13098,
      "link": "https://skills.sh/coreyhaines31/marketingskills/marketing-psychology",
      "providerId": "skills.sh",
      "description": "When the user wants to apply psychological principles, mental models, or behavioral science to marketing. Also use when the user mentions 'psychology,' 'mental models,' 'cognitive bias,' 'persuasion,' 'behavioral science,' 'why people buy,' 'decision-making,' or 'consumer behavior.' This skill provides 70+ mental models organized for marketing application."
    },
    {
      "id": "anthropics/skills/webapp-testing",
      "title": "webapp-testing",
      "source": "anthropics/skills",
      "installs": 12526,
      "link": "https://skills.sh/anthropics/skills/webapp-testing",
      "providerId": "skills.sh",
      "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs."
    },
    {
      "id": "obra/superpowers/writing-plans",
      "title": "writing-plans",
      "source": "obra/superpowers",
      "installs": 12516,
      "link": "https://skills.sh/obra/superpowers/writing-plans",
      "providerId": "skills.sh",
      "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
    },
    {
      "id": "obra/superpowers/test-driven-development",
      "title": "test-driven-development",
      "source": "obra/superpowers",
      "installs": 11635,
      "link": "https://skills.sh/obra/superpowers/test-driven-development",
      "providerId": "skills.sh",
      "description": "Use when implementing any feature or bugfix, before writing implementation code"
    },
    {
      "id": "expo/skills/building-native-ui",
      "title": "building-native-ui",
      "source": "expo/skills",
      "installs": 11612,
      "link": "https://skills.sh/expo/skills/building-native-ui",
      "providerId": "skills.sh",
      "description": "Complete guide for building beautiful apps with Expo Router. Covers fundamentals, styling, components, navigation, animations, patterns, and native tabs."
    },
    {
      "id": "coreyhaines31/marketingskills/programmatic-seo",
      "title": "programmatic-seo",
      "source": "coreyhaines31/marketingskills",
      "installs": 11286,
      "link": "https://skills.sh/coreyhaines31/marketingskills/programmatic-seo",
      "providerId": "skills.sh",
      "description": "When the user wants to create SEO-driven pages at scale using templates and data. Also use when the user mentions \"programmatic SEO,\" \"template pages,\" \"pages at scale,\" \"directory pages,\" \"location pages,\" \"[keyword] + [city] pages,\" \"comparison pages,\" \"integration pages,\" or \"building many pages for SEO.\" For auditing existing SEO issues, see seo-audit."
    },
    {
      "id": "anthropics/skills/mcp-builder",
      "title": "mcp-builder",
      "source": "anthropics/skills",
      "installs": 11170,
      "link": "https://skills.sh/anthropics/skills/mcp-builder",
      "providerId": "skills.sh",
      "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK)."
    },
    {
      "id": "coreyhaines31/marketingskills/content-strategy",
      "title": "content-strategy",
      "source": "coreyhaines31/marketingskills",
      "installs": 11158,
      "link": "https://skills.sh/coreyhaines31/marketingskills/content-strategy",
      "providerId": "skills.sh",
      "description": "When the user wants to plan a content strategy, decide what content to create, or figure out what topics to cover. Also use when the user mentions \"content strategy,\" \"what should I write about,\" \"content ideas,\" \"blog strategy,\" \"topic clusters,\" or \"content planning.\" For writing individual pieces, see copywriting. For SEO-specific audits, see seo-audit."
    },
    {
      "id": "obra/superpowers/executing-plans",
      "title": "executing-plans",
      "source": "obra/superpowers",
      "installs": 10616,
      "link": "https://skills.sh/obra/superpowers/executing-plans",
      "providerId": "skills.sh",
      "description": "Use when you have a written implementation plan to execute in a separate session with review checkpoints"
    }
  ],
  "topTrending": [
    {
      "id": "microsoft/github-copilot-for-azure/azure-storage",
      "title": "azure-storage",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9440,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-storage",
      "providerId": "skills.sh",
      "description": "Azure Storage Services including Blob Storage, File Shares, Queue Storage, Table Storage, and Data Lake. Provides object storage, SMB file shares, async messaging, NoSQL key-value, and big data analytics capabilities. Includes access tiers (hot, cool, archive) and lifecycle management."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-observability",
      "title": "azure-observability",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9438,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-observability",
      "providerId": "skills.sh",
      "description": "Azure Observability Services including Azure Monitor, Application Insights, Log Analytics, Alerts, and Workbooks. Provides metrics, APM, distributed tracing, KQL queries, and interactive reports."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-cost-optimization",
      "title": "azure-cost-optimization",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9434,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-cost-optimization",
      "providerId": "skills.sh",
      "description": "Identify and quantify cost savings across Azure subscriptions by analyzing actual costs,\nutilization metrics, and generating actionable optimization recommendations. USE FOR:\noptimize Azure costs, reduce Azure spending, reduce Azure expenses, analyze Azure costs,\nfind cost savings, generate cost optimization report, find orphaned resources, rightsize VMs,\ncost analysis, reduce waste, Azure spending analysis, find unused resources, optimize Redis\ncosts. DO NOT USE FOR: deploying resources (use azure-deploy), general Azure diagnostics\n(use azure-diagnostics), security issues (use azure-security)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-diagnostics",
      "title": "azure-diagnostics",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9433,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-diagnostics",
      "providerId": "skills.sh",
      "description": "Debug and troubleshoot production issues on Azure. Covers Container Apps diagnostics, log analysis with KQL, health checks, and common issue resolution for image pulls, cold starts, and health probes.\nUSE FOR: debug production issues, troubleshoot container apps, analyze logs with KQL, fix image pull failures, resolve cold start issues, investigate health probe failures, check resource health, view application logs, find root cause of errors\nDO NOT USE FOR: deploying applications (use azure-deploy), creating new resources (use azure-prepare), setting up monitoring (use azure-observability), cost optimization (use azure-cost-optimization)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-deploy",
      "title": "azure-deploy",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9433,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-deploy",
      "providerId": "skills.sh",
      "description": "Execute deployment to Azure. Final step after preparation and validation. Runs azd up, azd deploy, or infrastructure provisioning commands.\nUSE FOR: run azd up, run azd deploy, execute deployment, provision infrastructure, push to production, go live, ship it, deploy web app, deploy container app, deploy static site, deploy Azure Functions, bicep deploy, terraform apply.\nDO NOT USE FOR: creating or building apps (use azure-prepare), validating before deploy (use azure-validate)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-ai",
      "title": "azure-ai",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9431,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-ai",
      "providerId": "skills.sh",
      "description": "Use for Azure AI: Search, Speech, OpenAI, Document Intelligence. Helps with search, vector/hybrid search, speech-to-text, text-to-speech, transcription, OCR. USE FOR: AI Search, query search, vector search, hybrid search, semantic search, speech-to-text, text-to-speech, transcribe, OCR, convert text to speech. DO NOT USE FOR: Function apps/Functions (use azure-functions), databases (azure-postgres/azure-kusto), general Azure resources."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "title": "azure-resource-visualizer",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9430,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "providerId": "skills.sh",
      "description": "Analyze Azure resource groups and generate detailed Mermaid architecture diagrams showing the relationships between individual resources.\nUSE FOR: create architecture diagram, visualize Azure resources, show resource relationships, generate Mermaid diagram, analyze resource group, diagram my resources, architecture visualization, resource topology, map Azure infrastructure\nDO NOT USE FOR: creating/modifying resources (use azure-deploy), security scanning (use azure-security), performance troubleshooting (use azure-diagnostics), code generation (use relevant service skill)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-kusto",
      "title": "azure-kusto",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9430,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-kusto",
      "providerId": "skills.sh",
      "description": "Query and analyze data in Azure Data Explorer (Kusto/ADX) using KQL for log analytics, telemetry, and time series analysis.\nUSE FOR: KQL queries, Kusto database queries, Azure Data Explorer, ADX clusters, log analytics, time series data, IoT telemetry, anomaly detection\nDO NOT USE FOR: SQL databases (use azure-postgres), NoSQL queries (use azure-storage), Elasticsearch, AWS analytics tools"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-rbac",
      "title": "azure-rbac",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9429,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-rbac",
      "providerId": "skills.sh",
      "description": "Helps users find the right Azure RBAC role for an identity with least privilege access, then generate CLI commands and Bicep code to assign it.\nUSE FOR: \"what role should I assign\", \"least privilege role\", \"RBAC role for\", \"role to read blobs\", \"role for managed identity\", \"custom role definition\", \"assign role to identity\".\nDO NOT USE FOR: creating or configuring managed identities, or general Azure security hardening; those are out of scope for this role-selection skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-postgres",
      "title": "azure-postgres",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9429,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-postgres",
      "providerId": "skills.sh",
      "description": "Create new Azure Database for PostgreSQL Flexible Server instances and configure passwordless authentication with Microsoft Entra ID. Set up developer access, managed identities for apps, group-based permissions, and migrate from password-based to Entra ID authentication. Trigger phrases include \"passwordless for postgres\", \"entra id postgres\", \"azure ad postgres authentication\", \"postgres managed identity\", \"migrate postgres to passwordless\"."
    },
    {
      "id": "microsoft/github-copilot-for-azure/entra-app-registration",
      "title": "entra-app-registration",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9428,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/entra-app-registration",
      "providerId": "skills.sh",
      "description": "Guides Microsoft Entra ID app registration, OAuth 2.0 authentication, and MSAL integration.\nUSE FOR: create app registration, register Azure AD app, configure OAuth, set up authentication, add API permissions, generate service principal, MSAL example, console app auth, Entra ID setup, Azure AD authentication.\nDO NOT USE FOR: Azure RBAC or role assignments (use azure-rbac), Key Vault secrets (use azure-keyvault-expiration-audit), Azure resource security (use azure-security)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-lookup",
      "title": "azure-resource-lookup",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9427,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-lookup",
      "providerId": "skills.sh",
      "description": "List, find, and show Azure resources. Answers \"list my VMs\", \"show my storage accounts\", \"list websites\",\n\"find container apps\", \"what resources do I have\", and similar queries for any Azure resource type.\nUSE FOR: list resources, list virtual machines, list VMs, list storage accounts, list websites, list web apps,\nlist container apps, show resources, find resources, what resources do I have, list resources in resource group,\nlist resources in subscription, find resources by tag, find orphaned resources, resource inventory,\ncount resources by type, cross-subscription resource query, Azure Resource Graph, resource discovery,\nlist container registries, list SQL servers, list Key Vaults, show resource groups, list app services,\nfind resources across subscriptions, find unattached disks, tag analysis.\nDO NOT USE FOR: deploying resources (use azure-deploy), creating or modifying resources,\ncost optimization (use azure-cost-optimization), writing application code, non-Azure clouds."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-compliance",
      "title": "azure-compliance",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9427,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-compliance",
      "providerId": "skills.sh",
      "description": "Comprehensive Azure compliance and security auditing capabilities including best practices assessment,\nKey Vault expiration monitoring, and resource configuration validation.\nUSE FOR: compliance scan, security audit, azqr, Azure best practices, Key Vault expiration check,\ncompliance assessment, resource review, configuration validation, expired certificates, expiring secrets,\norphaned resources, policy compliance, security posture evaluation.\nDO NOT USE FOR: deploying resources (use azure-deploy), cost analysis alone (use azure-cost-optimization),\nactive security hardening (use azure-security-hardening), general Azure Advisor queries (use azure-observability)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-prepare",
      "title": "azure-prepare",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9427,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-prepare",
      "providerId": "skills.sh",
      "description": "Default entry point for Azure application development. Invoke this skill for ANY application work related to Azure: creating apps, building features, adding components, updating code, migrating, or modernizing. Analyzes your project and prepares it for Azure deployment by generating infrastructure code (Bicep/Terraform), azure.yaml configuration, and Dockerfiles.\nUSE FOR: create an app, build a web app, create API, create frontend, create backend, add a feature, build a service, make an application, develop a project, migrate my app, modernize my code, update my application, add database, add authentication, add caching, deploy to Azure, host on Azure, Azure with Terraform (defaults to azd+Terraform), Azure with azd, generate azure.yaml, generate Bicep or Terraform, prepare Azure Functions.\nDO NOT USE FOR: only validating an already-prepared app (use azure-validate), only running azd up/deploy (use azure-deploy), pure Terraform without azd (prefer azd+Terraform)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "title": "appinsights-instrumentation",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9427,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "providerId": "skills.sh",
      "description": "Guidance for instrumenting webapps with Azure Application Insights. Provides telemetry patterns, SDK setup, and configuration references.\nUSE FOR: how to instrument app, App Insights SDK, telemetry patterns, what is App Insights, Application Insights guidance, instrumentation examples, APM best practices.\nDO NOT USE FOR: adding App Insights to my app (use azure-prepare), add telemetry to my project (use azure-prepare), add monitoring (use azure-prepare). This skill provides guidance—azure-prepare orchestrates component changes."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-validate",
      "title": "azure-validate",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9427,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-validate",
      "providerId": "skills.sh",
      "description": "Pre-deployment validation checkpoint. Run deep checks to ensure your application is ready for Azure deployment. Validates configuration, infrastructure, permissions, and prerequisites.\nUSE FOR: validate my app, check deployment readiness, run preflight checks, verify configuration, check if ready to deploy, validate azure.yaml, validate Bicep, test before deploying, troubleshoot deployment errors.\nDO NOT USE FOR: creating or building apps (use azure-prepare), executing deployments (use azure-deploy)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/microsoft-foundry",
      "title": "microsoft-foundry",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9426,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/microsoft-foundry",
      "providerId": "skills.sh",
      "description": "Use this skill to work with Microsoft Foundry (Azure AI Foundry): deploy AI models from catalog, build RAG applications with knowledge indexes, create and evaluate AI agents, manage RBAC permissions and role assignments, manage quotas and capacity, create Foundry resources.\nUSE FOR: Microsoft Foundry, AI Foundry, deploy model, model catalog, RAG, knowledge index, create agent, evaluate agent, agent monitoring, create Foundry project, new Foundry project, set up Foundry, onboard to Foundry, provision Foundry infrastructure, create Foundry resource, create AI Services, multi-service resource, AIServices kind, register resource provider, enable Cognitive Services, setup AI Services account, create resource group for Foundry, RBAC, role assignment, managed identity, service principal, permissions, quota, capacity, TPM, deployment failure, QuotaExceeded.\nDO NOT USE FOR: Azure Functions (use azure-functions), App Service (use azure-create-app), generic Azure resource creation (use azure-create-app)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-aigateway",
      "title": "azure-aigateway",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 9425,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-aigateway",
      "providerId": "skills.sh",
      "description": "Configure Azure API Management (APIM) as AI Gateway to secure, observe, control AI models, MCP servers, agents. Helps with rate limiting, semantic caching, content safety, load balancing.\nUSE FOR: AI Gateway, APIM, setup gateway, configure gateway, add gateway, model gateway, MCP server, rate limit, token limit, semantic cache, content safety, load balance, OpenAPI import, convert API to MCP.\nDO NOT USE FOR: deploy models (use microsoft-foundry), Azure Functions (use azure-functions), databases (use azure-postgres)."
    },
    {
      "id": "vercel-labs/skills/find-skills",
      "title": "find-skills",
      "source": "vercel-labs/skills",
      "installs": 7678,
      "link": "https://skills.sh/vercel-labs/skills/find-skills",
      "providerId": "skills.sh",
      "description": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-best-practices",
      "title": "vercel-react-best-practices",
      "source": "vercel-labs/agent-skills",
      "installs": 3045,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-best-practices",
      "providerId": "skills.sh",
      "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
    },
    {
      "id": "anthropics/skills/frontend-design",
      "title": "frontend-design",
      "source": "anthropics/skills",
      "installs": 2650,
      "link": "https://skills.sh/anthropics/skills/frontend-design",
      "providerId": "skills.sh",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
    },
    {
      "id": "vercel-labs/agent-browser/agent-browser",
      "title": "agent-browser",
      "source": "vercel-labs/agent-browser",
      "installs": 2637,
      "link": "https://skills.sh/vercel-labs/agent-browser/agent-browser",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, test web applications, or extract information from web pages."
    },
    {
      "id": "inference-sh-6/skills/agent-tools",
      "title": "agent-tools",
      "source": "inference-sh-6/skills",
      "installs": 2634,
      "link": "https://skills.sh/inference-sh-6/skills/agent-tools",
      "providerId": "skills.sh",
      "description": "Run 150+ AI apps via inference.sh CLI - image generation, video creation, LLMs, search, 3D, Twitter automation. Models: FLUX, Veo, Gemini, Grok, Claude, Seedance, OmniHuman, Tavily, Exa, OpenRouter, and many more. Use when running AI apps, generating images/videos, calling LLMs, web search, or automating Twitter. Triggers: inference.sh, infsh, ai model, run ai, serverless ai, ai api, flux, veo, claude api, image generation, video generation, openrouter, tavily, exa search, twitter api, grok"
    },
    {
      "id": "inference-sh-6/skills/remotion-render",
      "title": "remotion-render",
      "source": "inference-sh-6/skills",
      "installs": 2568,
      "link": "https://skills.sh/inference-sh-6/skills/remotion-render",
      "providerId": "skills.sh",
      "description": "Render videos from React/Remotion component code via inference.sh. Pass TSX code, get MP4. Supports all Remotion APIs: useCurrentFrame, useVideoConfig, spring, interpolate, AbsoluteFill, Sequence. Configurable resolution, FPS, duration, codec. Use for: programmatic video generation, animated graphics, motion design, data-driven videos, React animations to video. Triggers: remotion, render video from code, tsx to video, react video, programmatic video, remotion render, code to video, animated video, motion graphics code, react animation video"
    },
    {
      "id": "vercel-labs/agent-skills/web-design-guidelines",
      "title": "web-design-guidelines",
      "source": "vercel-labs/agent-skills",
      "installs": 2443,
      "link": "https://skills.sh/vercel-labs/agent-skills/web-design-guidelines",
      "providerId": "skills.sh",
      "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
    },
    {
      "id": "remotion-dev/skills/remotion-best-practices",
      "title": "remotion-best-practices",
      "source": "remotion-dev/skills",
      "installs": 1832,
      "link": "https://skills.sh/remotion-dev/skills/remotion-best-practices",
      "providerId": "skills.sh",
      "description": "Best practices for Remotion - Video creation in React"
    },
    {
      "id": "vercel-labs/agent-skills/vercel-composition-patterns",
      "title": "vercel-composition-patterns",
      "source": "vercel-labs/agent-skills",
      "installs": 1447,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-composition-patterns",
      "providerId": "skills.sh",
      "description": "React composition patterns that scale. Use when refactoring components with boolean prop proliferation, building flexible component libraries, or designing reusable APIs. Triggers on tasks involving compound components, render props, context providers, or component architecture."
    },
    {
      "id": "hexiaochun/seedance2-api/seedance2-api",
      "title": "seedance2-api",
      "source": "hexiaochun/seedance2-api",
      "installs": 1443,
      "link": "https://skills.sh/hexiaochun/seedance2-api/seedance2-api",
      "providerId": "skills.sh",
      "description": "Out-of-the-box Seedance 2.0 API skill — just one API key to generate AI videos. Builds storyboards, generates reference images with Seedream 4.5, submits video tasks, and polls results. Supports both MCP and standalone Python script mode. Use when the user mentions seedance, AI video, storyboard, or video generation."
    },
    {
      "id": "anthropics/skills/skill-creator",
      "title": "skill-creator",
      "source": "anthropics/skills",
      "installs": 1152,
      "link": "https://skills.sh/anthropics/skills/skill-creator",
      "providerId": "skills.sh",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
    },
    {
      "id": "nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "title": "ui-ux-pro-max",
      "source": "nextlevelbuilder/ui-ux-pro-max-skill",
      "installs": 1128,
      "link": "https://skills.sh/nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "providerId": "skills.sh",
      "description": "UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, create, design, implement, review, fix, improve, optimize, enhance, refactor, check UI/UX code. Projects: website, landing page, dashboard, admin panel, e-commerce, SaaS, portfolio, blog, mobile app, .html, .tsx, .vue, .svelte. Elements: button, modal, navbar, sidebar, card, table, form, chart. Styles: glassmorphism, claymorphism, minimalism, brutalism, neumorphism, bento grid, dark mode, responsive, skeuomorphism, flat design. Topics: color palette, accessibility, animation, layout, typography, font pairing, spacing, hover, shadow, gradient. Integrations: shadcn/ui MCP for component search and examples."
    },
    {
      "id": "obra/superpowers/brainstorming",
      "title": "brainstorming",
      "source": "obra/superpowers",
      "installs": 984,
      "link": "https://skills.sh/obra/superpowers/brainstorming",
      "providerId": "skills.sh",
      "description": "You MUST use this before any creative work - creating features, building components, adding functionality, or modifying behavior. Explores user intent, requirements and design before implementation."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-native-skills",
      "title": "vercel-react-native-skills",
      "source": "vercel-labs/agent-skills",
      "installs": 941,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-native-skills",
      "providerId": "skills.sh",
      "description": "React Native and Expo best practices for building performant mobile apps. Use when building React Native components, optimizing list performance, implementing animations, or working with native modules. Triggers on tasks involving React Native, Expo, mobile performance, or native platform APIs."
    },
    {
      "id": "mcp-use/mcp-use/mcp-apps-builder",
      "title": "mcp-apps-builder",
      "source": "mcp-use/mcp-use",
      "installs": 895,
      "link": "https://skills.sh/mcp-use/mcp-use/mcp-apps-builder",
      "providerId": "skills.sh",
      "description": "**MANDATORY for ALL MCP server work** - mcp-use framework best practices and patterns.\n\n**READ THIS FIRST** before any MCP server work, including:\n- Creating new MCP servers\n- Modifying existing MCP servers (adding/updating tools, resources, prompts, widgets)\n- Debugging MCP server issues or errors\n- Reviewing MCP server code for quality, security, or performance\n- Answering questions about MCP development or mcp-use patterns\n- Making ANY changes to server.tool(), server.resource(), server.prompt(), or widgets\n\nThis skill contains critical architecture decisions, security patterns, and common pitfalls.\nAlways consult the relevant reference files BEFORE implementing MCP features."
    },
    {
      "id": "mcp-use/mcp-use/chatgpt-app-builder",
      "title": "chatgpt-app-builder",
      "source": "mcp-use/mcp-use",
      "installs": 889,
      "link": "https://skills.sh/mcp-use/mcp-use/chatgpt-app-builder",
      "providerId": "skills.sh",
      "description": "Build ChatGPT apps with interactive widgets using mcp-use and OpenAI Apps SDK.\nUse when creating ChatGPT apps, building MCP servers with widgets, defining React widgets,\nworking with Apps SDK, or when user mentions ChatGPT widgets, mcp-use widgets, or Apps SDK development."
    },
    {
      "id": "mcp-use/mcp-use/mcp-builder",
      "title": "mcp-builder",
      "source": "mcp-use/mcp-use",
      "installs": 888,
      "link": "https://skills.sh/mcp-use/mcp-use/mcp-builder",
      "providerId": "skills.sh",
      "description": "Build Model Context Protocol (MCP) servers with mcp-use framework.\nUse when creating MCP servers, defining tools/resources/prompts, working with mcp-use,\nbootstrapping MCP projects, or when user mentions MCP development, tools, resources, or prompts."
    },
    {
      "id": "vercel-labs/next-skills/next-best-practices",
      "title": "next-best-practices",
      "source": "vercel-labs/next-skills",
      "installs": 847,
      "link": "https://skills.sh/vercel-labs/next-skills/next-best-practices",
      "providerId": "skills.sh",
      "description": "Next.js best practices - file conventions, RSC boundaries, data patterns, async APIs, metadata, error handling, route handlers, image/font optimization, bundling"
    },
    {
      "id": "coreyhaines31/marketingskills/seo-audit",
      "title": "seo-audit",
      "source": "coreyhaines31/marketingskills",
      "installs": 709,
      "link": "https://skills.sh/coreyhaines31/marketingskills/seo-audit",
      "providerId": "skills.sh",
      "description": "When the user wants to audit, review, or diagnose SEO issues on their site. Also use when the user mentions \"SEO audit,\" \"technical SEO,\" \"why am I not ranking,\" \"SEO issues,\" \"on-page SEO,\" \"meta tags review,\" or \"SEO health check.\" For building pages at scale to target keywords, see programmatic-seo. For adding structured data, see schema-markup."
    },
    {
      "id": "squirrelscan/skills/audit-website",
      "title": "audit-website",
      "source": "squirrelscan/skills",
      "installs": 637,
      "link": "https://skills.sh/squirrelscan/skills/audit-website",
      "providerId": "skills.sh",
      "description": "Audit websites for SEO, performance, security, technical, content, and 15 other issue cateories with 150+ rules using the squirrelscan CLI. Returns LLM-optimized reports with health scores, broken links, meta tag analysis, and actionable recommendations. Use to discover and asses website or webapp issues and health."
    },
    {
      "id": "supabase/agent-skills/supabase-postgres-best-practices",
      "title": "supabase-postgres-best-practices",
      "source": "supabase/agent-skills",
      "installs": 621,
      "link": "https://skills.sh/supabase/agent-skills/supabase-postgres-best-practices",
      "providerId": "skills.sh",
      "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations."
    },
    {
      "id": "coreyhaines31/marketingskills/copywriting",
      "title": "copywriting",
      "source": "coreyhaines31/marketingskills",
      "installs": 609,
      "link": "https://skills.sh/coreyhaines31/marketingskills/copywriting",
      "providerId": "skills.sh",
      "description": "When the user wants to write, rewrite, or improve marketing copy for any page — including homepage, landing pages, pricing pages, feature pages, about pages, or product pages. Also use when the user says \"write copy for,\" \"improve this copy,\" \"rewrite this page,\" \"marketing copy,\" \"headline help,\" or \"CTA copy.\" For email copy, see email-sequence. For popup copy, see popup-cro."
    },
    {
      "id": "anthropics/skills/pdf",
      "title": "pdf",
      "source": "anthropics/skills",
      "installs": 538,
      "link": "https://skills.sh/anthropics/skills/pdf",
      "providerId": "skills.sh",
      "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale."
    },
    {
      "id": "obra/superpowers/systematic-debugging",
      "title": "systematic-debugging",
      "source": "obra/superpowers",
      "installs": 526,
      "link": "https://skills.sh/obra/superpowers/systematic-debugging",
      "providerId": "skills.sh",
      "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
    },
    {
      "id": "obra/superpowers/writing-plans",
      "title": "writing-plans",
      "source": "obra/superpowers",
      "installs": 475,
      "link": "https://skills.sh/obra/superpowers/writing-plans",
      "providerId": "skills.sh",
      "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
    },
    {
      "id": "inference-sh-6/skills/twitter-automation",
      "title": "twitter-automation",
      "source": "inference-sh-6/skills",
      "installs": 439,
      "link": "https://skills.sh/inference-sh-6/skills/twitter-automation",
      "providerId": "skills.sh",
      "description": "Automate Twitter/X with posting, engagement, and user management via inference.sh CLI. Apps: x/post-tweet, x/post-create (with media), x/post-like, x/post-retweet, x/dm-send, x/user-follow. Capabilities: post tweets, schedule content, like posts, retweet, send DMs, follow users, get profiles. Use for: social media automation, content scheduling, engagement bots, audience growth, X API. Triggers: twitter api, x api, tweet automation, post to twitter, twitter bot, social media automation, x automation, tweet scheduler, twitter integration, post tweet, twitter post, x post, send tweet"
    },
    {
      "id": "anthropics/skills/pptx",
      "title": "pptx",
      "source": "anthropics/skills",
      "installs": 434,
      "link": "https://skills.sh/anthropics/skills/pptx",
      "providerId": "skills.sh",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks"
    },
    {
      "id": "inference-sh-6/skills/ai-image-generation",
      "title": "ai-image-generation",
      "source": "inference-sh-6/skills",
      "installs": 428,
      "link": "https://skills.sh/inference-sh-6/skills/ai-image-generation",
      "providerId": "skills.sh",
      "description": "Generate AI images with FLUX, Gemini, Grok, Seedream, Reve and 50+ models via inference.sh CLI. Models: FLUX Dev LoRA, FLUX.2 Klein LoRA, Gemini 3 Pro Image, Grok Imagine, Seedream 4.5, Reve, ImagineArt. Capabilities: text-to-image, image-to-image, inpainting, LoRA, image editing, upscaling, text rendering. Use for: AI art, product mockups, concept art, social media graphics, marketing visuals, illustrations. Triggers: flux, image generation, ai image, text to image, stable diffusion, generate image, ai art, midjourney alternative, dall-e alternative, text2img, t2i, image generator, ai picture, create image with ai, generative ai, ai illustration, grok image, gemini image"
    },
    {
      "id": "inference-sh-6/skills/ai-video-generation",
      "title": "ai-video-generation",
      "source": "inference-sh-6/skills",
      "installs": 406,
      "link": "https://skills.sh/inference-sh-6/skills/ai-video-generation",
      "providerId": "skills.sh",
      "description": "Generate AI videos with Google Veo, Seedance, Wan, Grok and 40+ models via inference.sh CLI. Models: Veo 3.1, Veo 3, Seedance 1.5 Pro, Wan 2.5, Grok Imagine Video, OmniHuman, Fabric, HunyuanVideo. Capabilities: text-to-video, image-to-video, lipsync, avatar animation, video upscaling, foley sound. Use for: social media videos, marketing content, explainer videos, product demos, AI avatars. Triggers: video generation, ai video, text to video, image to video, veo, animate image, video from image, ai animation, video generator, generate video, t2v, i2v, ai video maker, create video with ai, runway alternative, pika alternative, sora alternative, kling alternative"
    },
    {
      "id": "obra/superpowers/test-driven-development",
      "title": "test-driven-development",
      "source": "obra/superpowers",
      "installs": 399,
      "link": "https://skills.sh/obra/superpowers/test-driven-development",
      "providerId": "skills.sh",
      "description": "Use when implementing any feature or bugfix, before writing implementation code"
    },
    {
      "id": "coreyhaines31/marketingskills/marketing-psychology",
      "title": "marketing-psychology",
      "source": "coreyhaines31/marketingskills",
      "installs": 392,
      "link": "https://skills.sh/coreyhaines31/marketingskills/marketing-psychology",
      "providerId": "skills.sh",
      "description": "When the user wants to apply psychological principles, mental models, or behavioral science to marketing. Also use when the user mentions 'psychology,' 'mental models,' 'cognitive bias,' 'persuasion,' 'behavioral science,' 'why people buy,' 'decision-making,' or 'consumer behavior.' This skill provides 70+ mental models organized for marketing application."
    },
    {
      "id": "browser-use/browser-use/browser-use",
      "title": "browser-use",
      "source": "browser-use/browser-use",
      "installs": 386,
      "link": "https://skills.sh/browser-use/browser-use/browser-use",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, or extract information from web pages."
    }
  ],
  "topHot": [
    {
      "id": "inference-sh-6/skills/remotion-render",
      "title": "remotion-render",
      "source": "inference-sh-6/skills",
      "installs": 517,
      "link": "https://skills.sh/inference-sh-6/skills/remotion-render",
      "providerId": "skills.sh",
      "description": "Render videos from React/Remotion component code via inference.sh. Pass TSX code, get MP4. Supports all Remotion APIs: useCurrentFrame, useVideoConfig, spring, interpolate, AbsoluteFill, Sequence. Configurable resolution, FPS, duration, codec. Use for: programmatic video generation, animated graphics, motion design, data-driven videos, React animations to video. Triggers: remotion, render video from code, tsx to video, react video, programmatic video, remotion render, code to video, animated video, motion graphics code, react animation video"
    },
    {
      "id": "inference-sh-6/skills/agent-tools",
      "title": "agent-tools",
      "source": "inference-sh-6/skills",
      "installs": 510,
      "link": "https://skills.sh/inference-sh-6/skills/agent-tools",
      "providerId": "skills.sh",
      "description": "Run 150+ AI apps via inference.sh CLI - image generation, video creation, LLMs, search, 3D, Twitter automation. Models: FLUX, Veo, Gemini, Grok, Claude, Seedance, OmniHuman, Tavily, Exa, OpenRouter, and many more. Use when running AI apps, generating images/videos, calling LLMs, web search, or automating Twitter. Triggers: inference.sh, infsh, ai model, run ai, serverless ai, ai api, flux, veo, claude api, image generation, video generation, openrouter, tavily, exa search, twitter api, grok"
    },
    {
      "id": "inference-sh-6/skills/twitter-automation",
      "title": "twitter-automation",
      "source": "inference-sh-6/skills",
      "installs": 84,
      "link": "https://skills.sh/inference-sh-6/skills/twitter-automation",
      "providerId": "skills.sh",
      "description": "Automate Twitter/X with posting, engagement, and user management via inference.sh CLI. Apps: x/post-tweet, x/post-create (with media), x/post-like, x/post-retweet, x/dm-send, x/user-follow. Capabilities: post tweets, schedule content, like posts, retweet, send DMs, follow users, get profiles. Use for: social media automation, content scheduling, engagement bots, audience growth, X API. Triggers: twitter api, x api, tweet automation, post to twitter, twitter bot, social media automation, x automation, tweet scheduler, twitter integration, post tweet, twitter post, x post, send tweet"
    },
    {
      "id": "inference-sh-6/skills/ai-image-generation",
      "title": "ai-image-generation",
      "source": "inference-sh-6/skills",
      "installs": 79,
      "link": "https://skills.sh/inference-sh-6/skills/ai-image-generation",
      "providerId": "skills.sh",
      "description": "Generate AI images with FLUX, Gemini, Grok, Seedream, Reve and 50+ models via inference.sh CLI. Models: FLUX Dev LoRA, FLUX.2 Klein LoRA, Gemini 3 Pro Image, Grok Imagine, Seedream 4.5, Reve, ImagineArt. Capabilities: text-to-image, image-to-image, inpainting, LoRA, image editing, upscaling, text rendering. Use for: AI art, product mockups, concept art, social media graphics, marketing visuals, illustrations. Triggers: flux, image generation, ai image, text to image, stable diffusion, generate image, ai art, midjourney alternative, dall-e alternative, text2img, t2i, image generator, ai picture, create image with ai, generative ai, ai illustration, grok image, gemini image"
    },
    {
      "id": "inference-sh-6/skills/ai-video-generation",
      "title": "ai-video-generation",
      "source": "inference-sh-6/skills",
      "installs": 69,
      "link": "https://skills.sh/inference-sh-6/skills/ai-video-generation",
      "providerId": "skills.sh",
      "description": "Generate AI videos with Google Veo, Seedance, Wan, Grok and 40+ models via inference.sh CLI. Models: Veo 3.1, Veo 3, Seedance 1.5 Pro, Wan 2.5, Grok Imagine Video, OmniHuman, Fabric, HunyuanVideo. Capabilities: text-to-video, image-to-video, lipsync, avatar animation, video upscaling, foley sound. Use for: social media videos, marketing content, explainer videos, product demos, AI avatars. Triggers: video generation, ai video, text to video, image to video, veo, animate image, video from image, ai animation, video generator, generate video, t2v, i2v, ai video maker, create video with ai, runway alternative, pika alternative, sora alternative, kling alternative"
    },
    {
      "id": "squirrelscan/skills/audit-website",
      "title": "audit-website",
      "source": "squirrelscan/skills",
      "installs": 65,
      "link": "https://skills.sh/squirrelscan/skills/audit-website",
      "providerId": "skills.sh",
      "description": "Audit websites for SEO, performance, security, technical, content, and 15 other issue cateories with 150+ rules using the squirrelscan CLI. Returns LLM-optimized reports with health scores, broken links, meta tag analysis, and actionable recommendations. Use to discover and asses website or webapp issues and health."
    },
    {
      "id": "inference-sh-6/skills/javascript-sdk",
      "title": "javascript-sdk",
      "source": "inference-sh-6/skills",
      "installs": 33,
      "link": "https://skills.sh/inference-sh-6/skills/javascript-sdk",
      "providerId": "skills.sh",
      "description": "JavaScript/TypeScript SDK for inference.sh - run AI apps, build agents, integrate 150+ models. Package: @inferencesh/sdk (npm install). Full TypeScript support, streaming, file uploads. Build agents with template or ad-hoc patterns, tool builder API, skills, human approval. Use for: JavaScript integration, TypeScript, Node.js, React, Next.js, frontend apps. Triggers: javascript sdk, typescript sdk, npm install, node.js api, js client, react ai, next.js ai, frontend sdk, @inferencesh/sdk, typescript agent, browser sdk, js integration"
    },
    {
      "id": "inference-sh-6/skills/agent-ui",
      "title": "agent-ui",
      "source": "inference-sh-6/skills",
      "installs": 28,
      "link": "https://skills.sh/inference-sh-6/skills/agent-ui",
      "providerId": "skills.sh",
      "description": "name: agent-ui"
    },
    {
      "id": "inference-sh-6/skills/web-search",
      "title": "web-search",
      "source": "inference-sh-6/skills",
      "installs": 26,
      "link": "https://skills.sh/inference-sh-6/skills/web-search",
      "providerId": "skills.sh",
      "description": "Web search and content extraction with Tavily and Exa via inference.sh CLI. Apps: Tavily Search, Tavily Extract, Exa Search, Exa Answer, Exa Extract. Capabilities: AI-powered search, content extraction, direct answers, research. Use for: research, RAG pipelines, fact-checking, content aggregation, agents. Triggers: web search, tavily, exa, search api, content extraction, research, internet search, ai search, search assistant, web scraping, rag, perplexity alternative"
    },
    {
      "id": "inference-sh-6/skills/image-to-video",
      "title": "image-to-video",
      "source": "inference-sh-6/skills",
      "installs": 24,
      "link": "https://skills.sh/inference-sh-6/skills/image-to-video",
      "providerId": "skills.sh",
      "description": "Still-to-video conversion guide: model selection, motion prompting, and camera movement. Covers Wan 2.5 i2v, Seedance, Fabric, Grok Video with when to use each. Use for: animating images, creating video from stills, adding motion, product animations. Triggers: image to video, i2v, animate image, still to video, add motion to image, image animation, photo to video, animate still, wan i2v, image2video, bring image to life, animate photo, motion from image"
    },
    {
      "id": "inference-sh-6/skills/speech-to-text",
      "title": "speech-to-text",
      "source": "inference-sh-6/skills",
      "installs": 24,
      "link": "https://skills.sh/inference-sh-6/skills/speech-to-text",
      "providerId": "skills.sh",
      "description": "Transcribe audio to text with Whisper models via inference.sh CLI. Models: Fast Whisper Large V3, Whisper V3 Large. Capabilities: transcription, translation, multi-language, timestamps. Use for: meeting transcription, subtitles, podcast transcripts, voice notes. Triggers: speech to text, transcription, whisper, audio to text, transcribe audio, voice to text, stt, automatic transcription, subtitles generation, transcribe meeting, audio transcription, whisper ai"
    },
    {
      "id": "inference-sh-6/skills/dialogue-audio",
      "title": "dialogue-audio",
      "source": "inference-sh-6/skills",
      "installs": 23,
      "link": "https://skills.sh/inference-sh-6/skills/dialogue-audio",
      "providerId": "skills.sh",
      "description": "Multi-speaker dialogue audio creation with Dia TTS. Covers speaker tags, emotion control, pacing, conversation flow, and post-production. Use for: podcasts, audiobooks, explainers, character dialogue, conversational content. Triggers: dialogue audio, multi speaker, conversation audio, dia tts, two speakers, podcast audio, character voices, voice acting, dialogue generation, conversation tts, multi voice, speaker tags, dialogue recording"
    },
    {
      "id": "inference-sh-6/skills/case-study-writing",
      "title": "case-study-writing",
      "source": "inference-sh-6/skills",
      "installs": 22,
      "link": "https://skills.sh/inference-sh-6/skills/case-study-writing",
      "providerId": "skills.sh",
      "description": "B2B case study writing with STAR framework, data visualization, and research. Covers structure, customer quotes, metrics presentation, and distribution formats. Use for: customer success stories, portfolio pieces, sales enablement, marketing content. Triggers: case study, customer story, success story, b2b case study, client testimonial, customer case study, portfolio case study, use case, customer win, results story"
    },
    {
      "id": "inference-sh-6/skills/book-cover-design",
      "title": "book-cover-design",
      "source": "inference-sh-6/skills",
      "installs": 22,
      "link": "https://skills.sh/inference-sh-6/skills/book-cover-design",
      "providerId": "skills.sh",
      "description": "Book cover design with genre-specific conventions, typography rules, and AI image generation. Covers fiction and non-fiction genres, sizing, thumbnail testing, and iteration workflows. Use for: self-publishing, ebook covers, print covers, audiobook covers, cover mockups. Triggers: book cover, cover design, ebook cover, book art, novel cover, self publishing cover, kindle cover, audiobook cover, book jacket, cover illustration, fiction cover, nonfiction cover"
    },
    {
      "id": "inference-sh-6/skills/linkedin-content",
      "title": "linkedin-content",
      "source": "inference-sh-6/skills",
      "installs": 21,
      "link": "https://skills.sh/inference-sh-6/skills/linkedin-content",
      "providerId": "skills.sh",
      "description": "LinkedIn post writing with hook formulas, formatting rules, and engagement patterns. Covers post types, algorithm signals, character limits, and content pillars. Use for: LinkedIn posts, professional content, thought leadership, B2B content, personal branding. Triggers: linkedin post, linkedin content, linkedin writing, linkedin strategy, linkedin engagement, linkedin algorithm, linkedin hook, linkedin formatting, thought leadership, professional content, b2b content, linkedin growth"
    },
    {
      "id": "inference-sh-6/skills/seo-content-brief",
      "title": "seo-content-brief",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/seo-content-brief",
      "providerId": "skills.sh",
      "description": "SEO content brief creation with keyword research, search intent analysis, and content structure. Covers SERP analysis, heading hierarchy, word count targets, and internal linking strategy. Use for: content briefs, SEO writing, blog strategy, content planning, keyword targeting. Triggers: seo content brief, content brief, seo brief, keyword research, search intent, content strategy, blog brief, seo writing, content planning, keyword targeting, serp analysis, content outline, seo article, blog seo"
    },
    {
      "id": "inference-sh-6/skills/content-repurposing",
      "title": "content-repurposing",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/content-repurposing",
      "providerId": "skills.sh",
      "description": "Content atomization — turn one piece of content into many formats. Covers blog-to-thread, blog-to-carousel, podcast-to-blog, video-to-quotes, and more. Use for: content marketing, social media, multi-platform distribution, content strategy. Triggers: content repurposing, repurpose content, content atomization, content recycling, one to many content, multi platform content, cross post, adapt content, reformat content, blog to thread, blog to video, podcast to blog, content multiplication"
    },
    {
      "id": "inference-sh-6/skills/python-executor",
      "title": "python-executor",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/python-executor",
      "providerId": "skills.sh",
      "description": "Execute Python code in a safe sandboxed environment via [inference.sh](https://inference.sh). Pre-installed: NumPy, Pandas, Matplotlib, requests, BeautifulSoup, Selenium, Playwright, MoviePy, Pillow, OpenCV, trimesh, and 100+ more libraries. Use for: data processing, web scraping, image manipulation, video creation, 3D model processing, PDF generation, API calls, automation scripts. Triggers: python, execute code, run script, web scraping, data analysis, image processing, video editing, 3D models, automation, pandas, matplotlib"
    },
    {
      "id": "inference-sh-6/skills/tools-ui",
      "title": "tools-ui",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/tools-ui",
      "providerId": "skills.sh",
      "description": "name: tools-ui"
    },
    {
      "id": "inference-sh-6/skills/widgets-ui",
      "title": "widgets-ui",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/widgets-ui",
      "providerId": "skills.sh",
      "description": "name: widgets-ui"
    },
    {
      "id": "inference-sh-6/skills/google-veo",
      "title": "google-veo",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/google-veo",
      "providerId": "skills.sh",
      "description": "Generate videos with Google Veo models via inference.sh CLI. Models: Veo 3.1, Veo 3.1 Fast, Veo 3, Veo 3 Fast, Veo 2. Capabilities: text-to-video, cinematic output, high quality video generation. Triggers: veo, google veo, veo 3, veo 2, veo 3.1, vertex ai video, google video generation, google video ai, veo model, veo video"
    },
    {
      "id": "inference-sh-6/skills/customer-persona",
      "title": "customer-persona",
      "source": "inference-sh-6/skills",
      "installs": 19,
      "link": "https://skills.sh/inference-sh-6/skills/customer-persona",
      "providerId": "skills.sh",
      "description": "Research-backed customer persona creation with market data and avatar generation. Covers demographics, psychographics, jobs-to-be-done, journey mapping, and anti-personas. Use for: marketing strategy, product development, UX research, sales enablement, content strategy. Triggers: customer persona, buyer persona, user persona, target audience, ideal customer, customer profile, audience research, user research, icp, ideal customer profile, target market, customer avatar, audience persona"
    },
    {
      "id": "inference-sh-6/skills/python-sdk",
      "title": "python-sdk",
      "source": "inference-sh-6/skills",
      "installs": 19,
      "link": "https://skills.sh/inference-sh-6/skills/python-sdk",
      "providerId": "skills.sh",
      "description": "Python SDK for inference.sh - run AI apps, build agents, and integrate with 150+ models. Package: inferencesh (pip install inferencesh). Supports sync/async, streaming, file uploads. Build agents with template or ad-hoc patterns, tool builder API, skills, and human approval. Use for: Python integration, AI apps, agent development, RAG pipelines, automation. Triggers: python sdk, inferencesh, pip install, python api, python client, async inference, python agent, tool builder python, programmatic ai, python integration, sdk python"
    },
    {
      "id": "inference-sh-6/skills/ai-music-generation",
      "title": "ai-music-generation",
      "source": "inference-sh-6/skills",
      "installs": 18,
      "link": "https://skills.sh/inference-sh-6/skills/ai-music-generation",
      "providerId": "skills.sh",
      "description": "Generate AI music and songs with Diffrythm, Tencent Song Generation via inference.sh CLI. Models: Diffrythm (fast song generation), Tencent Song Generation (full songs with vocals). Capabilities: text-to-music, song generation, instrumental, lyrics to song, soundtrack creation. Use for: background music, social media content, game soundtracks, podcasts, royalty-free music. Triggers: music generation, ai music, generate song, ai composer, text to music, song generator, create music with ai, suno alternative, udio alternative, ai song, ai soundtrack, generate soundtrack, ai jingle, music ai, beat generator"
    },
    {
      "id": "inference-sh-6/skills/video-ad-specs",
      "title": "video-ad-specs",
      "source": "inference-sh-6/skills",
      "installs": 18,
      "link": "https://skills.sh/inference-sh-6/skills/video-ad-specs",
      "providerId": "skills.sh",
      "description": "Video ad creation with exact platform-specific specs for TikTok, Instagram, YouTube, Facebook, LinkedIn. Covers dimensions, duration limits, AIDA framework, and caption requirements. Use for: video ads, social media ads, paid media creative, video marketing, ad production. Triggers: video ad, social media ad, tiktok ad, instagram ad, youtube ad, facebook ad, linkedin ad, video creative, ad specs, paid media, video marketing, ad production, reels ad, stories ad, pre roll, bumper ad"
    },
    {
      "id": "inference-sh-6/skills/product-hunt-launch",
      "title": "product-hunt-launch",
      "source": "inference-sh-6/skills",
      "installs": 18,
      "link": "https://skills.sh/inference-sh-6/skills/product-hunt-launch",
      "providerId": "skills.sh",
      "description": "Product Hunt launch optimization with specific specs, timing, and gallery strategy. Covers taglines, gallery images, maker comments, and launch day tactics. Use for: product launches, startup launches, side project launches, Product Hunt optimization. Triggers: product hunt, ph launch, product hunt launch, launch strategy, product launch, startup launch, product hunt tips, product hunt gallery, ph optimization, launch day, product hunt maker"
    },
    {
      "id": "inference-sh-6/skills/ai-product-photography",
      "title": "ai-product-photography",
      "source": "inference-sh-6/skills",
      "installs": 18,
      "link": "https://skills.sh/inference-sh-6/skills/ai-product-photography",
      "providerId": "skills.sh",
      "description": "Generate professional AI product photography and commercial images. Models: FLUX, Imagen 3, Grok, Seedream for product shots, lifestyle images, mockups. Capabilities: studio lighting, lifestyle scenes, packaging, e-commerce photos. Use for: e-commerce, Amazon listings, Shopify, marketing, advertising, mockups. Triggers: product photography, product shot, commercial photography, e-commerce images, amazon product photo, shopify images, product mockup, studio product shot, lifestyle product image, advertising photo, packshot, product render, product image ai"
    },
    {
      "id": "inference-sh-6/skills/data-visualization",
      "title": "data-visualization",
      "source": "inference-sh-6/skills",
      "installs": 18,
      "link": "https://skills.sh/inference-sh-6/skills/data-visualization",
      "providerId": "skills.sh",
      "description": "Data visualization with chart selection, color theory, and annotation best practices. Covers chart types (bar, line, scatter, heatmap), axes rules, and storytelling with data. Use for: charts, graphs, dashboards, reports, presentations, infographics, data stories. Triggers: data visualization, chart, graph, data chart, bar chart, line chart, scatter plot, data viz, visualization, dashboard chart, infographic data, data presentation, chart design, plot, heatmap, pie chart alternative"
    },
    {
      "id": "inference-sh-6/skills/twitter-thread-creation",
      "title": "twitter-thread-creation",
      "source": "inference-sh-6/skills",
      "installs": 17,
      "link": "https://skills.sh/inference-sh-6/skills/twitter-thread-creation",
      "providerId": "skills.sh",
      "description": "Twitter/X thread writing with hook tweets, thread structure, and engagement optimization. Covers tweet formatting, character limits, media attachments, and posting strategies. Use for: Twitter threads, X posts, tweet storms, Twitter content, social media writing. Triggers: twitter thread, tweet thread, x thread, twitter post, tweet writing, thread creation, tweet storm, twitter content, x post, twitter writing, twitter hook, tweet formatting, thread structure"
    },
    {
      "id": "inference-sh-6/skills/talking-head-production",
      "title": "talking-head-production",
      "source": "inference-sh-6/skills",
      "installs": 17,
      "link": "https://skills.sh/inference-sh-6/skills/talking-head-production",
      "providerId": "skills.sh",
      "description": "Talking head video production with AI avatars, lipsync, and voiceover. Covers portrait requirements, audio quality, OmniHuman, PixVerse lipsync, Dia TTS. Use for: spokesperson videos, course content, social media, presentations, demos. Triggers: talking head, avatar video, lipsync, lip sync, ai spokesperson, virtual presenter, ai presenter, omnihuman, talking avatar, video presenter, ai talking head, presenter video, ai face video"
    },
    {
      "id": "inference-sh-6/skills/chat-ui",
      "title": "chat-ui",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/chat-ui",
      "providerId": "skills.sh",
      "description": "name: chat-ui"
    },
    {
      "id": "inference-sh-6/skills/competitor-teardown",
      "title": "competitor-teardown",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/competitor-teardown",
      "providerId": "skills.sh",
      "description": "Structured competitive analysis with feature matrices, SWOT, positioning maps, and UX review. Covers research frameworks, pricing comparison, review mining, and visual deliverables. Use for: market research, competitive intelligence, investor decks, product strategy, sales enablement. Triggers: competitor analysis, competitive analysis, competitor teardown, market research, competitive intelligence, swot analysis, competitor comparison, market landscape, competitor review, competitive landscape, feature comparison, market positioning"
    },
    {
      "id": "inference-sh-6/skills/explainer-video-guide",
      "title": "explainer-video-guide",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/explainer-video-guide",
      "providerId": "skills.sh",
      "description": "Explainer video production guide: scripting, voiceover, visuals, and assembly. Covers script formulas, pacing rules, scene planning, and multi-tool pipelines. Use for: product demos, how-it-works videos, onboarding videos, social explainers. Triggers: explainer video, how to make explainer, product video, demo video, video production, video script, animated explainer, product demo video, tutorial video, onboarding video, walkthrough video, video pipeline"
    },
    {
      "id": "inference-sh-6/skills/storyboard-creation",
      "title": "storyboard-creation",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/storyboard-creation",
      "providerId": "skills.sh",
      "description": "Film and video storyboarding with shot vocabulary, continuity rules, and panel layout. Covers shot types, camera angles, movement, 180-degree rule, and annotation format. Use for: video planning, film pre-production, ad storyboards, music video planning, animation. Triggers: storyboard, storyboarding, shot list, film planning, video planning, pre production, shot composition, camera angles, scene planning, visual script, animatic, storyboard panels, video storyboard"
    },
    {
      "id": "inference-sh-6/skills/llm-models",
      "title": "llm-models",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/llm-models",
      "providerId": "skills.sh",
      "description": "Access Claude, Gemini, Kimi, GLM and 100+ LLMs via inference.sh CLI using OpenRouter. Models: Claude Opus 4.5, Claude Sonnet 4.5, Claude Haiku 4.5, Gemini 3 Pro, Kimi K2, GLM-4.6, Intellect 3. One API for all models with automatic fallback and cost optimization. Use for: AI assistants, code generation, reasoning, agents, chat, content generation. Triggers: claude api, openrouter, llm api, claude sonnet, claude opus, gemini api, kimi, language model, gpt alternative, anthropic api, ai model api, llm access, chat api, claude alternative, openai alternative"
    },
    {
      "id": "google-labs-code/stitch-skills/stitch-loop",
      "title": "stitch-loop",
      "source": "google-labs-code/stitch-skills",
      "installs": 23,
      "link": "https://skills.sh/google-labs-code/stitch-skills/stitch-loop",
      "providerId": "skills.sh",
      "description": "Teaches agents to iteratively build websites using Stitch with an autonomous baton-passing loop pattern"
    },
    {
      "id": "google-labs-code/stitch-skills/design-md",
      "title": "design-md",
      "source": "google-labs-code/stitch-skills",
      "installs": 23,
      "link": "https://skills.sh/google-labs-code/stitch-skills/design-md",
      "providerId": "skills.sh",
      "description": "Analyze Stitch projects and synthesize a semantic design system into DESIGN.md files"
    },
    {
      "id": "inference-sh-6/skills/ai-automation-workflows",
      "title": "ai-automation-workflows",
      "source": "inference-sh-6/skills",
      "installs": 15,
      "link": "https://skills.sh/inference-sh-6/skills/ai-automation-workflows",
      "providerId": "skills.sh",
      "description": "Build automated AI workflows combining multiple models and services. Patterns: batch processing, scheduled tasks, event-driven pipelines, agent loops. Tools: inference.sh CLI, bash scripting, Python SDK, webhook integration. Use for: content automation, data processing, monitoring, scheduled generation. Triggers: ai automation, workflow automation, batch processing, ai pipeline, automated content, scheduled ai, ai cron, ai batch job, automated generation, ai workflow, content at scale, automation script, ai orchestration"
    },
    {
      "id": "inference-sh-6/skills/app-store-screenshots",
      "title": "app-store-screenshots",
      "source": "inference-sh-6/skills",
      "installs": 15,
      "link": "https://skills.sh/inference-sh-6/skills/app-store-screenshots",
      "providerId": "skills.sh",
      "description": "App Store and Google Play screenshot creation with exact platform specs. Covers iOS/Android dimensions, gallery ordering, device mockups, and preview videos. Use for: app store optimization, ASO, app screenshots, app preview, play store listing. Triggers: app store screenshots, aso, app store optimization, play store screenshots, app preview, app listing, ios screenshots, android screenshots, app store images, app mockup, device mockup, app gallery, store listing"
    },
    {
      "id": "inference-sh-6/skills/pitch-deck-visuals",
      "title": "pitch-deck-visuals",
      "source": "inference-sh-6/skills",
      "installs": 15,
      "link": "https://skills.sh/inference-sh-6/skills/pitch-deck-visuals",
      "providerId": "skills.sh",
      "description": "Investor pitch deck structure with slide-by-slide framework, visual design rules, and data presentation. Covers the 12-slide framework, chart types, team slides, and common investor turn-offs. Use for: fundraising decks, investor presentations, startup pitch, demo day, grant proposals. Triggers: pitch deck, investor deck, startup pitch, fundraising deck, demo day, pitch presentation, investor presentation, seed deck, series a deck, pitch slides, startup presentation, vc pitch, investor meeting"
    },
    {
      "id": "inference-sh-6/skills/product-photography",
      "title": "product-photography",
      "source": "inference-sh-6/skills",
      "installs": 15,
      "link": "https://skills.sh/inference-sh-6/skills/product-photography",
      "providerId": "skills.sh",
      "description": "AI product photography with studio lighting, lifestyle shots, and packshot conventions. Covers angles, backgrounds, shadow types, hero shots, and e-commerce image requirements. Use for: product photos, e-commerce images, Amazon listings, packshots, lifestyle photography. Triggers: product photography, product photo, packshot, e-commerce photography, product shot, product image, studio photography, lifestyle product, amazon product photo, product listing image, hero shot, product mockup, commercial photography"
    },
    {
      "id": "anthropics/skills/pptx",
      "title": "pptx",
      "source": "anthropics/skills",
      "installs": 27,
      "link": "https://skills.sh/anthropics/skills/pptx",
      "providerId": "skills.sh",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks"
    },
    {
      "id": "inference-sh-6/skills/press-release-writing",
      "title": "press-release-writing",
      "source": "inference-sh-6/skills",
      "installs": 14,
      "link": "https://skills.sh/inference-sh-6/skills/press-release-writing",
      "providerId": "skills.sh",
      "description": "Press release writing in AP style with inverted pyramid structure. Covers formatting, datelines, quotes, boilerplates, and fact-checking. Use for: product launches, funding announcements, partnerships, company news, events. Triggers: press release, pr writing, media release, news release, announcement, product launch announcement, funding announcement, company news, media advisory, ap style, press statement, news wire"
    },
    {
      "id": "inference-sh-6/skills/ai-content-pipeline",
      "title": "ai-content-pipeline",
      "source": "inference-sh-6/skills",
      "installs": 14,
      "link": "https://skills.sh/inference-sh-6/skills/ai-content-pipeline",
      "providerId": "skills.sh",
      "description": "Build multi-step AI content creation pipelines combining image, video, audio, and text. Workflow examples: generate image -> animate -> add voiceover -> merge with music. Tools: FLUX, Veo, Kokoro TTS, OmniHuman, media merger, upscaling. Use for: YouTube videos, social media content, marketing materials, automated content. Triggers: content pipeline, ai workflow, content creation, multi-step ai, content automation, ai video workflow, generate and edit, ai content factory, automated content creation, ai production pipeline, media pipeline, content at scale"
    },
    {
      "id": "inference-sh-6/skills/video-prompting-guide",
      "title": "video-prompting-guide",
      "source": "inference-sh-6/skills",
      "installs": 14,
      "link": "https://skills.sh/inference-sh-6/skills/video-prompting-guide",
      "providerId": "skills.sh",
      "description": "Best practices and techniques for writing effective AI video generation prompts. Covers: Veo, Seedance, Wan, Grok, Kling, Runway, Pika, Sora prompting strategies. Learn: shot types, camera movements, lighting, pacing, style keywords, negative prompts. Use for: improving video quality, getting consistent results, professional video prompts. Triggers: video prompt, how to prompt video, veo prompts, video generation tips, better ai video, video prompt engineering, video prompt guide, video prompt template, ai video tips, video prompt best practices, video prompt examples, cinematography prompts"
    },
    {
      "id": "inference-sh-6/skills/technical-blog-writing",
      "title": "technical-blog-writing",
      "source": "inference-sh-6/skills",
      "installs": 14,
      "link": "https://skills.sh/inference-sh-6/skills/technical-blog-writing",
      "providerId": "skills.sh",
      "description": "Technical blog post writing with structure, code examples, and developer audience conventions. Covers post types, code formatting, explanation depth, and developer-specific engagement patterns. Use for: engineering blogs, dev tutorials, technical writing, developer content, documentation posts. Triggers: technical blog, dev blog, engineering blog, technical writing, developer tutorial, tech post, code tutorial, programming blog, developer content, technical article, engineering post, coding tutorial, technical content"
    },
    {
      "id": "inference-sh-6/skills/youtube-thumbnail-design",
      "title": "youtube-thumbnail-design",
      "source": "inference-sh-6/skills",
      "installs": 14,
      "link": "https://skills.sh/inference-sh-6/skills/youtube-thumbnail-design",
      "providerId": "skills.sh",
      "description": "YouTube thumbnail design with specific dimensions, contrast rules, and mobile preview optimization. Covers safe zones, text placement, face expression psychology, and A/B testing. Use for: YouTube thumbnails, video cover images, click-through optimization. Triggers: youtube thumbnail, thumbnail design, video thumbnail, click through rate, ctr optimization, youtube cover, video cover image, thumbnail maker, thumbnail tips, youtube design, video preview image"
    },
    {
      "id": "inference-sh-6/skills/landing-page-design",
      "title": "landing-page-design",
      "source": "inference-sh-6/skills",
      "installs": 13,
      "link": "https://skills.sh/inference-sh-6/skills/landing-page-design",
      "providerId": "skills.sh",
      "description": "Landing page conversion optimization with layout rules, hero section design, and CTA psychology. Covers above-the-fold formula, social proof placement, mobile design, and F-pattern reading. Use for: startup landing pages, product pages, SaaS marketing, conversion optimization. Triggers: landing page, hero section, above the fold, conversion optimization, landing page design, cta button, hero image, landing page layout, saas landing page, product page design, conversion rate, landing page best practices"
    },
    {
      "id": "inference-sh-6/skills/logo-design-guide",
      "title": "logo-design-guide",
      "source": "inference-sh-6/skills",
      "installs": 13,
      "link": "https://skills.sh/inference-sh-6/skills/logo-design-guide",
      "providerId": "skills.sh",
      "description": "Logo design principles and AI image generation best practices for creating logos. Covers logo types, prompting techniques, scalability rules, and iteration workflows. Use for: brand identity, startup logos, app icons, favicons, logo concepts. Triggers: logo design, create logo, brand logo, logo generation, ai logo, logo maker, icon design, brand mark, logo concept, startup logo, app icon logo"
    },
    {
      "id": "inference-sh-6/skills/ai-rag-pipeline",
      "title": "ai-rag-pipeline",
      "source": "inference-sh-6/skills",
      "installs": 13,
      "link": "https://skills.sh/inference-sh-6/skills/ai-rag-pipeline",
      "providerId": "skills.sh",
      "description": "Build RAG (Retrieval Augmented Generation) pipelines with web search and LLMs. Tools: Tavily Search, Exa Search, Exa Answer, Claude, GPT-4, Gemini via OpenRouter. Capabilities: research, fact-checking, grounded responses, knowledge retrieval. Use for: AI agents, research assistants, fact-checkers, knowledge bases. Triggers: rag, retrieval augmented generation, grounded ai, search and answer, research agent, fact checking, knowledge retrieval, ai research, search + llm, web grounded, perplexity alternative, ai with sources, citation, research pipeline"
    }
  ]
}