{
  "title": "Skills.sh Feed",
  "description": "Latest skill data from skills.sh",
  "link": "https://skills.sh",
  "updatedAt": "2026-02-22T13:02:38.077Z",
  "providers": [
    {
      "id": "skills.sh",
      "name": "skills.sh",
      "link": "https://skills.sh"
    }
  ],
  "topAllTime": [
    {
      "id": "vercel-labs/skills/find-skills",
      "title": "find-skills",
      "source": "vercel-labs/skills",
      "installs": 289303,
      "link": "https://skills.sh/vercel-labs/skills/find-skills",
      "providerId": "skills.sh",
      "description": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-best-practices",
      "title": "vercel-react-best-practices",
      "source": "vercel-labs/agent-skills",
      "installs": 155910,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-best-practices",
      "providerId": "skills.sh",
      "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
    },
    {
      "id": "vercel-labs/agent-skills/web-design-guidelines",
      "title": "web-design-guidelines",
      "source": "vercel-labs/agent-skills",
      "installs": 118330,
      "link": "https://skills.sh/vercel-labs/agent-skills/web-design-guidelines",
      "providerId": "skills.sh",
      "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
    },
    {
      "id": "remotion-dev/skills/remotion-best-practices",
      "title": "remotion-best-practices",
      "source": "remotion-dev/skills",
      "installs": 104478,
      "link": "https://skills.sh/remotion-dev/skills/remotion-best-practices",
      "providerId": "skills.sh",
      "description": "Best practices for Remotion - Video creation in React"
    },
    {
      "id": "anthropics/skills/frontend-design",
      "title": "frontend-design",
      "source": "anthropics/skills",
      "installs": 88918,
      "link": "https://skills.sh/anthropics/skills/frontend-design",
      "providerId": "skills.sh",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-composition-patterns",
      "title": "vercel-composition-patterns",
      "source": "vercel-labs/agent-skills",
      "installs": 51710,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-composition-patterns",
      "providerId": "skills.sh",
      "description": "React composition patterns that scale. Use when refactoring components with boolean prop proliferation, building flexible component libraries, or designing reusable APIs. Triggers on tasks involving compound components, render props, context providers, or component architecture."
    },
    {
      "id": "vercel-labs/agent-browser/agent-browser",
      "title": "agent-browser",
      "source": "vercel-labs/agent-browser",
      "installs": 51295,
      "link": "https://skills.sh/vercel-labs/agent-browser/agent-browser",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, test web applications, or extract information from web pages."
    },
    {
      "id": "anthropics/skills/skill-creator",
      "title": "skill-creator",
      "source": "anthropics/skills",
      "installs": 43044,
      "link": "https://skills.sh/anthropics/skills/skill-creator",
      "providerId": "skills.sh",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-native-skills",
      "title": "vercel-react-native-skills",
      "source": "vercel-labs/agent-skills",
      "installs": 36590,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-native-skills",
      "providerId": "skills.sh",
      "description": "React Native and Expo best practices for building performant mobile apps. Use when building React Native components, optimizing list performance, implementing animations, or working with native modules. Triggers on tasks involving React Native, Expo, mobile performance, or native platform APIs."
    },
    {
      "id": "browser-use/browser-use/browser-use",
      "title": "browser-use",
      "source": "browser-use/browser-use",
      "installs": 36004,
      "link": "https://skills.sh/browser-use/browser-use/browser-use",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, or extract information from web pages."
    },
    {
      "id": "nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "title": "ui-ux-pro-max",
      "source": "nextlevelbuilder/ui-ux-pro-max-skill",
      "installs": 34260,
      "link": "https://skills.sh/nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "providerId": "skills.sh",
      "description": "UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, create, design, implement, review, fix, improve, optimize, enhance, refactor, check UI/UX code. Projects: website, landing page, dashboard, admin panel, e-commerce, SaaS, portfolio, blog, mobile app, .html, .tsx, .vue, .svelte. Elements: button, modal, navbar, sidebar, card, table, form, chart. Styles: glassmorphism, claymorphism, minimalism, brutalism, neumorphism, bento grid, dark mode, responsive, skeuomorphism, flat design. Topics: color palette, accessibility, animation, layout, typography, font pairing, spacing, hover, shadow, gradient. Integrations: shadcn/ui MCP for component search and examples."
    },
    {
      "id": "obra/superpowers/brainstorming",
      "title": "brainstorming",
      "source": "obra/superpowers",
      "installs": 26668,
      "link": "https://skills.sh/obra/superpowers/brainstorming",
      "providerId": "skills.sh",
      "description": "You MUST use this before any creative work - creating features, building components, adding functionality, or modifying behavior. Explores user intent, requirements and design before implementation."
    },
    {
      "id": "squirrelscan/skills/audit-website",
      "title": "audit-website",
      "source": "squirrelscan/skills",
      "installs": 25150,
      "link": "https://skills.sh/squirrelscan/skills/audit-website",
      "providerId": "skills.sh",
      "description": "Audit websites for SEO, performance, security, technical, content, and 15 other issue cateories with 150+ rules using the squirrelscan CLI. Returns LLM-optimized reports with health scores, broken links, meta tag analysis, and actionable recommendations. Use to discover and asses website or webapp issues and health."
    },
    {
      "id": "coreyhaines31/marketingskills/seo-audit",
      "title": "seo-audit",
      "source": "coreyhaines31/marketingskills",
      "installs": 24103,
      "link": "https://skills.sh/coreyhaines31/marketingskills/seo-audit",
      "providerId": "skills.sh",
      "description": "When the user wants to audit, review, or diagnose SEO issues on their site. Also use when the user mentions \"SEO audit,\" \"technical SEO,\" \"why am I not ranking,\" \"SEO issues,\" \"on-page SEO,\" \"meta tags review,\" or \"SEO health check.\" For building pages at scale to target keywords, see programmatic-seo. For adding structured data, see schema-markup."
    },
    {
      "id": "supabase/agent-skills/supabase-postgres-best-practices",
      "title": "supabase-postgres-best-practices",
      "source": "supabase/agent-skills",
      "installs": 22335,
      "link": "https://skills.sh/supabase/agent-skills/supabase-postgres-best-practices",
      "providerId": "skills.sh",
      "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-observability",
      "title": "azure-observability",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20993,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-observability",
      "providerId": "skills.sh",
      "description": "Azure Observability Services including Azure Monitor, Application Insights, Log Analytics, Alerts, and Workbooks. Provides metrics, APM, distributed tracing, KQL queries, and interactive reports."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-storage",
      "title": "azure-storage",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20983,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-storage",
      "providerId": "skills.sh",
      "description": "Azure Storage Services including Blob Storage, File Shares, Queue Storage, Table Storage, and Data Lake. Provides object storage, SMB file shares, async messaging, NoSQL key-value, and big data analytics capabilities. Includes access tiers (hot, cool, archive) and lifecycle management."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-diagnostics",
      "title": "azure-diagnostics",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20981,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-diagnostics",
      "providerId": "skills.sh",
      "description": "Debug and troubleshoot production issues on Azure. Covers Container Apps diagnostics, log analysis with KQL, health checks, and common issue resolution for image pulls, cold starts, and health probes.\nUSE FOR: debug production issues, troubleshoot container apps, analyze logs with KQL, fix image pull failures, resolve cold start issues, investigate health probe failures, check resource health, view application logs, find root cause of errors\nDO NOT USE FOR: deploying applications (use azure-deploy), creating new resources (use azure-prepare), setting up monitoring (use azure-observability), cost optimization (use azure-cost-optimization)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-ai",
      "title": "azure-ai",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20979,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-ai",
      "providerId": "skills.sh",
      "description": "Use for Azure AI: Search, Speech, OpenAI, Document Intelligence. Helps with search, vector/hybrid search, speech-to-text, text-to-speech, transcription, OCR. USE FOR: AI Search, query search, vector search, hybrid search, semantic search, speech-to-text, text-to-speech, transcribe, OCR, convert text to speech. DO NOT USE FOR: Function apps/Functions (use azure-functions), databases (azure-postgres/azure-kusto), general Azure resources."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-cost-optimization",
      "title": "azure-cost-optimization",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20978,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-cost-optimization",
      "providerId": "skills.sh",
      "description": "Identify and quantify cost savings across Azure subscriptions by analyzing actual costs,\nutilization metrics, and generating actionable optimization recommendations. USE FOR:\noptimize Azure costs, reduce Azure spending, reduce Azure expenses, analyze Azure costs,\nfind cost savings, generate cost optimization report, find orphaned resources, rightsize VMs,\ncost analysis, reduce waste, Azure spending analysis, find unused resources, optimize Redis\ncosts. DO NOT USE FOR: deploying resources (use azure-deploy), general Azure diagnostics\n(use azure-diagnostics), security issues (use azure-security)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-kusto",
      "title": "azure-kusto",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20972,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-kusto",
      "providerId": "skills.sh",
      "description": "Query and analyze data in Azure Data Explorer (Kusto/ADX) using KQL for log analytics, telemetry, and time series analysis.\nUSE FOR: KQL queries, Kusto database queries, Azure Data Explorer, ADX clusters, log analytics, time series data, IoT telemetry, anomaly detection\nDO NOT USE FOR: SQL databases (use azure-postgres), NoSQL queries (use azure-storage), Elasticsearch, AWS analytics tools"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-deploy",
      "title": "azure-deploy",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20968,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-deploy",
      "providerId": "skills.sh",
      "description": "Execute deployment to Azure. Final step after preparation and validation. Runs azd up, azd deploy, or infrastructure provisioning commands.\nUSE FOR: run azd up, run azd deploy, execute deployment, provision infrastructure, push to production, go live, ship it, deploy web app, deploy container app, deploy static site, deploy Azure Functions, bicep deploy, terraform apply.\nDO NOT USE FOR: creating or building apps (use azure-prepare), validating before deploy (use azure-validate)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "title": "azure-resource-visualizer",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20965,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "providerId": "skills.sh",
      "description": "Analyze Azure resource groups and generate detailed Mermaid architecture diagrams showing the relationships between individual resources.\nUSE FOR: create architecture diagram, visualize Azure resources, show resource relationships, generate Mermaid diagram, analyze resource group, diagram my resources, architecture visualization, resource topology, map Azure infrastructure\nDO NOT USE FOR: creating/modifying resources (use azure-deploy), security scanning (use azure-security), performance troubleshooting (use azure-diagnostics), code generation (use relevant service skill)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-postgres",
      "title": "azure-postgres",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20962,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-postgres",
      "providerId": "skills.sh",
      "description": "Create new Azure Database for PostgreSQL Flexible Server instances and configure passwordless authentication with Microsoft Entra ID. Set up developer access, managed identities for apps, group-based permissions, and migrate from password-based to Entra ID authentication. Trigger phrases include \"passwordless for postgres\", \"entra id postgres\", \"azure ad postgres authentication\", \"postgres managed identity\", \"migrate postgres to passwordless\"."
    },
    {
      "id": "microsoft/github-copilot-for-azure/entra-app-registration",
      "title": "entra-app-registration",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20962,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/entra-app-registration",
      "providerId": "skills.sh",
      "description": "Guides Microsoft Entra ID app registration, OAuth 2.0 authentication, and MSAL integration.\nUSE FOR: create app registration, register Azure AD app, configure OAuth, set up authentication, add API permissions, generate service principal, MSAL example, console app auth, Entra ID setup, Azure AD authentication.\nDO NOT USE FOR: Azure RBAC or role assignments (use azure-rbac), Key Vault secrets (use azure-keyvault-expiration-audit), Azure resource security (use azure-security)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-validate",
      "title": "azure-validate",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20961,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-validate",
      "providerId": "skills.sh",
      "description": "Pre-deployment validation checkpoint. Run deep checks to ensure your application is ready for Azure deployment. Validates configuration, infrastructure, permissions, and prerequisites.\nUSE FOR: validate my app, check deployment readiness, run preflight checks, verify configuration, check if ready to deploy, validate azure.yaml, validate Bicep, test before deploying, troubleshoot deployment errors.\nDO NOT USE FOR: creating or building apps (use azure-prepare), executing deployments (use azure-deploy)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-compliance",
      "title": "azure-compliance",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20961,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-compliance",
      "providerId": "skills.sh",
      "description": "Comprehensive Azure compliance and security auditing capabilities including best practices assessment,\nKey Vault expiration monitoring, and resource configuration validation.\nUSE FOR: compliance scan, security audit, azqr, Azure best practices, Key Vault expiration check,\ncompliance assessment, resource review, configuration validation, expired certificates, expiring secrets,\norphaned resources, policy compliance, security posture evaluation.\nDO NOT USE FOR: deploying resources (use azure-deploy), cost analysis alone (use azure-cost-optimization),\nactive security hardening (use azure-security-hardening), general Azure Advisor queries (use azure-observability)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "title": "appinsights-instrumentation",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20960,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "providerId": "skills.sh",
      "description": "Guidance for instrumenting webapps with Azure Application Insights. Provides telemetry patterns, SDK setup, and configuration references.\nUSE FOR: how to instrument app, App Insights SDK, telemetry patterns, what is App Insights, Application Insights guidance, instrumentation examples, APM best practices.\nDO NOT USE FOR: adding App Insights to my app (use azure-prepare), add telemetry to my project (use azure-prepare), add monitoring (use azure-prepare). This skill provides guidance—azure-prepare orchestrates component changes."
    },
    {
      "id": "microsoft/github-copilot-for-azure/microsoft-foundry",
      "title": "microsoft-foundry",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20960,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/microsoft-foundry",
      "providerId": "skills.sh",
      "description": "Use this skill to work with Microsoft Foundry (Azure AI Foundry): deploy AI models from catalog, build RAG applications with knowledge indexes, create and evaluate AI agents, manage RBAC permissions and role assignments, manage quotas and capacity, create Foundry resources.\nUSE FOR: Microsoft Foundry, AI Foundry, deploy model, model catalog, RAG, knowledge index, create agent, evaluate agent, agent monitoring, create Foundry project, new Foundry project, set up Foundry, onboard to Foundry, provision Foundry infrastructure, create Foundry resource, create AI Services, multi-service resource, AIServices kind, register resource provider, enable Cognitive Services, setup AI Services account, create resource group for Foundry, RBAC, role assignment, managed identity, service principal, permissions, quota, capacity, TPM, deployment failure, QuotaExceeded.\nDO NOT USE FOR: Azure Functions (use azure-functions), App Service (use azure-create-app), generic Azure resource creation (use azure-create-app)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-prepare",
      "title": "azure-prepare",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20959,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-prepare",
      "providerId": "skills.sh",
      "description": "Default entry point for Azure application development. Invoke this skill for ANY application work related to Azure: creating apps, building features, adding components, updating code, migrating, or modernizing. Analyzes your project and prepares it for Azure deployment by generating infrastructure code (Bicep/Terraform), azure.yaml configuration, and Dockerfiles.\nUSE FOR: create an app, build a web app, create API, create frontend, create backend, add a feature, build a service, make an application, develop a project, migrate my app, modernize my code, update my application, add database, add authentication, add caching, deploy to Azure, host on Azure, Azure with Terraform (defaults to azd+Terraform), Azure with azd, generate azure.yaml, generate Bicep or Terraform, prepare Azure Functions.\nDO NOT USE FOR: only validating an already-prepared app (use azure-validate), only running azd up/deploy (use azure-deploy), pure Terraform without azd (prefer azd+Terraform)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-aigateway",
      "title": "azure-aigateway",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20957,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-aigateway",
      "providerId": "skills.sh",
      "description": "Configure Azure API Management (APIM) as AI Gateway to secure, observe, control AI models, MCP servers, agents. Helps with rate limiting, semantic caching, content safety, load balancing.\nUSE FOR: AI Gateway, APIM, setup gateway, configure gateway, add gateway, model gateway, MCP server, rate limit, token limit, semantic cache, content safety, load balance, OpenAPI import, convert API to MCP.\nDO NOT USE FOR: deploy models (use microsoft-foundry), Azure Functions (use azure-functions), databases (use azure-postgres)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-rbac",
      "title": "azure-rbac",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20953,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-rbac",
      "providerId": "skills.sh",
      "description": "Helps users find the right Azure RBAC role for an identity with least privilege access, then generate CLI commands and Bicep code to assign it.\nUSE FOR: \"what role should I assign\", \"least privilege role\", \"RBAC role for\", \"role to read blobs\", \"role for managed identity\", \"custom role definition\", \"assign role to identity\".\nDO NOT USE FOR: creating or configuring managed identities, or general Azure security hardening; those are out of scope for this role-selection skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-lookup",
      "title": "azure-resource-lookup",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 20953,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-lookup",
      "providerId": "skills.sh",
      "description": "List, find, and show Azure resources. Answers \"list my VMs\", \"show my storage accounts\", \"list websites\",\n\"find container apps\", \"what resources do I have\", and similar queries for any Azure resource type.\nUSE FOR: list resources, list virtual machines, list VMs, list storage accounts, list websites, list web apps,\nlist container apps, show resources, find resources, what resources do I have, list resources in resource group,\nlist resources in subscription, find resources by tag, find orphaned resources, resource inventory,\ncount resources by type, cross-subscription resource query, Azure Resource Graph, resource discovery,\nlist container registries, list SQL servers, list Key Vaults, show resource groups, list app services,\nfind resources across subscriptions, find unattached disks, tag analysis.\nDO NOT USE FOR: deploying resources (use azure-deploy), creating or modifying resources,\ncost optimization (use azure-cost-optimization), writing application code, non-Azure clouds."
    },
    {
      "id": "anthropics/skills/pdf",
      "title": "pdf",
      "source": "anthropics/skills",
      "installs": 18833,
      "link": "https://skills.sh/anthropics/skills/pdf",
      "providerId": "skills.sh",
      "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale."
    },
    {
      "id": "coreyhaines31/marketingskills/copywriting",
      "title": "copywriting",
      "source": "coreyhaines31/marketingskills",
      "installs": 18071,
      "link": "https://skills.sh/coreyhaines31/marketingskills/copywriting",
      "providerId": "skills.sh",
      "description": "When the user wants to write, rewrite, or improve marketing copy for any page — including homepage, landing pages, pricing pages, feature pages, about pages, or product pages. Also use when the user says \"write copy for,\" \"improve this copy,\" \"rewrite this page,\" \"marketing copy,\" \"headline help,\" or \"CTA copy.\" For email copy, see email-sequence. For popup copy, see popup-cro."
    },
    {
      "id": "vercel-labs/next-skills/next-best-practices",
      "title": "next-best-practices",
      "source": "vercel-labs/next-skills",
      "installs": 17725,
      "link": "https://skills.sh/vercel-labs/next-skills/next-best-practices",
      "providerId": "skills.sh",
      "description": "Next.js best practices - file conventions, RSC boundaries, data patterns, async APIs, metadata, error handling, route handlers, image/font optimization, bundling"
    },
    {
      "id": "anthropics/skills/pptx",
      "title": "pptx",
      "source": "anthropics/skills",
      "installs": 15519,
      "link": "https://skills.sh/anthropics/skills/pptx",
      "providerId": "skills.sh",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks"
    },
    {
      "id": "obra/superpowers/systematic-debugging",
      "title": "systematic-debugging",
      "source": "obra/superpowers",
      "installs": 14690,
      "link": "https://skills.sh/obra/superpowers/systematic-debugging",
      "providerId": "skills.sh",
      "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
    },
    {
      "id": "anthropics/skills/docx",
      "title": "docx",
      "source": "anthropics/skills",
      "installs": 14339,
      "link": "https://skills.sh/anthropics/skills/docx",
      "providerId": "skills.sh",
      "description": "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks"
    },
    {
      "id": "better-auth/skills/better-auth-best-practices",
      "title": "better-auth-best-practices",
      "source": "better-auth/skills",
      "installs": 14193,
      "link": "https://skills.sh/better-auth/skills/better-auth-best-practices",
      "providerId": "skills.sh",
      "description": "Skill for integrating Better Auth - the comprehensive TypeScript authentication framework."
    },
    {
      "id": "anthropics/skills/xlsx",
      "title": "xlsx",
      "source": "anthropics/skills",
      "installs": 14045,
      "link": "https://skills.sh/anthropics/skills/xlsx",
      "providerId": "skills.sh",
      "description": "Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data analysis and visualization in spreadsheets, or (5) Recalculating formulas"
    },
    {
      "id": "coreyhaines31/marketingskills/marketing-psychology",
      "title": "marketing-psychology",
      "source": "coreyhaines31/marketingskills",
      "installs": 13459,
      "link": "https://skills.sh/coreyhaines31/marketingskills/marketing-psychology",
      "providerId": "skills.sh",
      "description": "When the user wants to apply psychological principles, mental models, or behavioral science to marketing. Also use when the user mentions 'psychology,' 'mental models,' 'cognitive bias,' 'persuasion,' 'behavioral science,' 'why people buy,' 'decision-making,' or 'consumer behavior.' This skill provides 70+ mental models organized for marketing application."
    },
    {
      "id": "obra/superpowers/writing-plans",
      "title": "writing-plans",
      "source": "obra/superpowers",
      "installs": 12943,
      "link": "https://skills.sh/obra/superpowers/writing-plans",
      "providerId": "skills.sh",
      "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
    },
    {
      "id": "anthropics/skills/webapp-testing",
      "title": "webapp-testing",
      "source": "anthropics/skills",
      "installs": 12930,
      "link": "https://skills.sh/anthropics/skills/webapp-testing",
      "providerId": "skills.sh",
      "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs."
    },
    {
      "id": "inference-sh-6/skills/agent-tools",
      "title": "agent-tools",
      "source": "inference-sh-6/skills",
      "installs": 12549,
      "link": "https://skills.sh/inference-sh-6/skills/agent-tools",
      "providerId": "skills.sh",
      "description": "Run 150+ AI apps via inference.sh CLI - image generation, video creation, LLMs, search, 3D, Twitter automation. Models: FLUX, Veo, Gemini, Grok, Claude, Seedance, OmniHuman, Tavily, Exa, OpenRouter, and many more. Use when running AI apps, generating images/videos, calling LLMs, web search, or automating Twitter. Triggers: inference.sh, infsh, ai model, run ai, serverless ai, ai api, flux, veo, claude api, image generation, video generation, openrouter, tavily, exa search, twitter api, grok"
    },
    {
      "id": "inference-sh-6/skills/remotion-render",
      "title": "remotion-render",
      "source": "inference-sh-6/skills",
      "installs": 12511,
      "link": "https://skills.sh/inference-sh-6/skills/remotion-render",
      "providerId": "skills.sh",
      "description": "Render videos from React/Remotion component code via inference.sh. Pass TSX code, get MP4. Supports all Remotion APIs: useCurrentFrame, useVideoConfig, spring, interpolate, AbsoluteFill, Sequence. Configurable resolution, FPS, duration, codec. Use for: programmatic video generation, animated graphics, motion design, data-driven videos, React animations to video. Triggers: remotion, render video from code, tsx to video, react video, programmatic video, remotion render, code to video, animated video, motion graphics code, react animation video"
    },
    {
      "id": "obra/superpowers/test-driven-development",
      "title": "test-driven-development",
      "source": "obra/superpowers",
      "installs": 12012,
      "link": "https://skills.sh/obra/superpowers/test-driven-development",
      "providerId": "skills.sh",
      "description": "Use when implementing any feature or bugfix, before writing implementation code"
    },
    {
      "id": "expo/skills/building-native-ui",
      "title": "building-native-ui",
      "source": "expo/skills",
      "installs": 11871,
      "link": "https://skills.sh/expo/skills/building-native-ui",
      "providerId": "skills.sh",
      "description": "Complete guide for building beautiful apps with Expo Router. Covers fundamentals, styling, components, navigation, animations, patterns, and native tabs."
    },
    {
      "id": "coreyhaines31/marketingskills/programmatic-seo",
      "title": "programmatic-seo",
      "source": "coreyhaines31/marketingskills",
      "installs": 11604,
      "link": "https://skills.sh/coreyhaines31/marketingskills/programmatic-seo",
      "providerId": "skills.sh",
      "description": "When the user wants to create SEO-driven pages at scale using templates and data. Also use when the user mentions \"programmatic SEO,\" \"template pages,\" \"pages at scale,\" \"directory pages,\" \"location pages,\" \"[keyword] + [city] pages,\" \"comparison pages,\" \"integration pages,\" or \"building many pages for SEO.\" For auditing existing SEO issues, see seo-audit."
    },
    {
      "id": "anthropics/skills/mcp-builder",
      "title": "mcp-builder",
      "source": "anthropics/skills",
      "installs": 11494,
      "link": "https://skills.sh/anthropics/skills/mcp-builder",
      "providerId": "skills.sh",
      "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK)."
    }
  ],
  "topTrending": [
    {
      "id": "inference-sh-6/skills/remotion-render",
      "title": "remotion-render",
      "source": "inference-sh-6/skills",
      "installs": 9812,
      "link": "https://skills.sh/inference-sh-6/skills/remotion-render",
      "providerId": "skills.sh",
      "description": "Render videos from React/Remotion component code via inference.sh. Pass TSX code, get MP4. Supports all Remotion APIs: useCurrentFrame, useVideoConfig, spring, interpolate, AbsoluteFill, Sequence. Configurable resolution, FPS, duration, codec. Use for: programmatic video generation, animated graphics, motion design, data-driven videos, React animations to video. Triggers: remotion, render video from code, tsx to video, react video, programmatic video, remotion render, code to video, animated video, motion graphics code, react animation video"
    },
    {
      "id": "inference-sh-6/skills/agent-tools",
      "title": "agent-tools",
      "source": "inference-sh-6/skills",
      "installs": 9797,
      "link": "https://skills.sh/inference-sh-6/skills/agent-tools",
      "providerId": "skills.sh",
      "description": "Run 150+ AI apps via inference.sh CLI - image generation, video creation, LLMs, search, 3D, Twitter automation. Models: FLUX, Veo, Gemini, Grok, Claude, Seedance, OmniHuman, Tavily, Exa, OpenRouter, and many more. Use when running AI apps, generating images/videos, calling LLMs, web search, or automating Twitter. Triggers: inference.sh, infsh, ai model, run ai, serverless ai, ai api, flux, veo, claude api, image generation, video generation, openrouter, tavily, exa search, twitter api, grok"
    },
    {
      "id": "vercel-labs/skills/find-skills",
      "title": "find-skills",
      "source": "vercel-labs/skills",
      "installs": 7052,
      "link": "https://skills.sh/vercel-labs/skills/find-skills",
      "providerId": "skills.sh",
      "description": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-observability",
      "title": "azure-observability",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4048,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-observability",
      "providerId": "skills.sh",
      "description": "Azure Observability Services including Azure Monitor, Application Insights, Log Analytics, Alerts, and Workbooks. Provides metrics, APM, distributed tracing, KQL queries, and interactive reports."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-ai",
      "title": "azure-ai",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4046,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-ai",
      "providerId": "skills.sh",
      "description": "Use for Azure AI: Search, Speech, OpenAI, Document Intelligence. Helps with search, vector/hybrid search, speech-to-text, text-to-speech, transcription, OCR. USE FOR: AI Search, query search, vector search, hybrid search, semantic search, speech-to-text, text-to-speech, transcribe, OCR, convert text to speech. DO NOT USE FOR: Function apps/Functions (use azure-functions), databases (azure-postgres/azure-kusto), general Azure resources."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-diagnostics",
      "title": "azure-diagnostics",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4044,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-diagnostics",
      "providerId": "skills.sh",
      "description": "Debug and troubleshoot production issues on Azure. Covers Container Apps diagnostics, log analysis with KQL, health checks, and common issue resolution for image pulls, cold starts, and health probes.\nUSE FOR: debug production issues, troubleshoot container apps, analyze logs with KQL, fix image pull failures, resolve cold start issues, investigate health probe failures, check resource health, view application logs, find root cause of errors\nDO NOT USE FOR: deploying applications (use azure-deploy), creating new resources (use azure-prepare), setting up monitoring (use azure-observability), cost optimization (use azure-cost-optimization)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-cost-optimization",
      "title": "azure-cost-optimization",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4043,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-cost-optimization",
      "providerId": "skills.sh",
      "description": "Identify and quantify cost savings across Azure subscriptions by analyzing actual costs,\nutilization metrics, and generating actionable optimization recommendations. USE FOR:\noptimize Azure costs, reduce Azure spending, reduce Azure expenses, analyze Azure costs,\nfind cost savings, generate cost optimization report, find orphaned resources, rightsize VMs,\ncost analysis, reduce waste, Azure spending analysis, find unused resources, optimize Redis\ncosts. DO NOT USE FOR: deploying resources (use azure-deploy), general Azure diagnostics\n(use azure-diagnostics), security issues (use azure-security)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-storage",
      "title": "azure-storage",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4041,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-storage",
      "providerId": "skills.sh",
      "description": "Azure Storage Services including Blob Storage, File Shares, Queue Storage, Table Storage, and Data Lake. Provides object storage, SMB file shares, async messaging, NoSQL key-value, and big data analytics capabilities. Includes access tiers (hot, cool, archive) and lifecycle management."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-kusto",
      "title": "azure-kusto",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4038,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-kusto",
      "providerId": "skills.sh",
      "description": "Query and analyze data in Azure Data Explorer (Kusto/ADX) using KQL for log analytics, telemetry, and time series analysis.\nUSE FOR: KQL queries, Kusto database queries, Azure Data Explorer, ADX clusters, log analytics, time series data, IoT telemetry, anomaly detection\nDO NOT USE FOR: SQL databases (use azure-postgres), NoSQL queries (use azure-storage), Elasticsearch, AWS analytics tools"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-compliance",
      "title": "azure-compliance",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4037,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-compliance",
      "providerId": "skills.sh",
      "description": "Comprehensive Azure compliance and security auditing capabilities including best practices assessment,\nKey Vault expiration monitoring, and resource configuration validation.\nUSE FOR: compliance scan, security audit, azqr, Azure best practices, Key Vault expiration check,\ncompliance assessment, resource review, configuration validation, expired certificates, expiring secrets,\norphaned resources, policy compliance, security posture evaluation.\nDO NOT USE FOR: deploying resources (use azure-deploy), cost analysis alone (use azure-cost-optimization),\nactive security hardening (use azure-security-hardening), general Azure Advisor queries (use azure-observability)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "title": "azure-resource-visualizer",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4036,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "providerId": "skills.sh",
      "description": "Analyze Azure resource groups and generate detailed Mermaid architecture diagrams showing the relationships between individual resources.\nUSE FOR: create architecture diagram, visualize Azure resources, show resource relationships, generate Mermaid diagram, analyze resource group, diagram my resources, architecture visualization, resource topology, map Azure infrastructure\nDO NOT USE FOR: creating/modifying resources (use azure-deploy), security scanning (use azure-security), performance troubleshooting (use azure-diagnostics), code generation (use relevant service skill)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "title": "appinsights-instrumentation",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4036,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "providerId": "skills.sh",
      "description": "Guidance for instrumenting webapps with Azure Application Insights. Provides telemetry patterns, SDK setup, and configuration references.\nUSE FOR: how to instrument app, App Insights SDK, telemetry patterns, what is App Insights, Application Insights guidance, instrumentation examples, APM best practices.\nDO NOT USE FOR: adding App Insights to my app (use azure-prepare), add telemetry to my project (use azure-prepare), add monitoring (use azure-prepare). This skill provides guidance—azure-prepare orchestrates component changes."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-deploy",
      "title": "azure-deploy",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4036,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-deploy",
      "providerId": "skills.sh",
      "description": "Execute deployment to Azure. Final step after preparation and validation. Runs azd up, azd deploy, or infrastructure provisioning commands.\nUSE FOR: run azd up, run azd deploy, execute deployment, provision infrastructure, push to production, go live, ship it, deploy web app, deploy container app, deploy static site, deploy Azure Functions, bicep deploy, terraform apply.\nDO NOT USE FOR: creating or building apps (use azure-prepare), validating before deploy (use azure-validate)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-lookup",
      "title": "azure-resource-lookup",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4035,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-lookup",
      "providerId": "skills.sh",
      "description": "List, find, and show Azure resources. Answers \"list my VMs\", \"show my storage accounts\", \"list websites\",\n\"find container apps\", \"what resources do I have\", and similar queries for any Azure resource type.\nUSE FOR: list resources, list virtual machines, list VMs, list storage accounts, list websites, list web apps,\nlist container apps, show resources, find resources, what resources do I have, list resources in resource group,\nlist resources in subscription, find resources by tag, find orphaned resources, resource inventory,\ncount resources by type, cross-subscription resource query, Azure Resource Graph, resource discovery,\nlist container registries, list SQL servers, list Key Vaults, show resource groups, list app services,\nfind resources across subscriptions, find unattached disks, tag analysis.\nDO NOT USE FOR: deploying resources (use azure-deploy), creating or modifying resources,\ncost optimization (use azure-cost-optimization), writing application code, non-Azure clouds."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-postgres",
      "title": "azure-postgres",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4035,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-postgres",
      "providerId": "skills.sh",
      "description": "Create new Azure Database for PostgreSQL Flexible Server instances and configure passwordless authentication with Microsoft Entra ID. Set up developer access, managed identities for apps, group-based permissions, and migrate from password-based to Entra ID authentication. Trigger phrases include \"passwordless for postgres\", \"entra id postgres\", \"azure ad postgres authentication\", \"postgres managed identity\", \"migrate postgres to passwordless\"."
    },
    {
      "id": "microsoft/github-copilot-for-azure/microsoft-foundry",
      "title": "microsoft-foundry",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4035,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/microsoft-foundry",
      "providerId": "skills.sh",
      "description": "Use this skill to work with Microsoft Foundry (Azure AI Foundry): deploy AI models from catalog, build RAG applications with knowledge indexes, create and evaluate AI agents, manage RBAC permissions and role assignments, manage quotas and capacity, create Foundry resources.\nUSE FOR: Microsoft Foundry, AI Foundry, deploy model, model catalog, RAG, knowledge index, create agent, evaluate agent, agent monitoring, create Foundry project, new Foundry project, set up Foundry, onboard to Foundry, provision Foundry infrastructure, create Foundry resource, create AI Services, multi-service resource, AIServices kind, register resource provider, enable Cognitive Services, setup AI Services account, create resource group for Foundry, RBAC, role assignment, managed identity, service principal, permissions, quota, capacity, TPM, deployment failure, QuotaExceeded.\nDO NOT USE FOR: Azure Functions (use azure-functions), App Service (use azure-create-app), generic Azure resource creation (use azure-create-app)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-validate",
      "title": "azure-validate",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4035,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-validate",
      "providerId": "skills.sh",
      "description": "Pre-deployment validation checkpoint. Run deep checks to ensure your application is ready for Azure deployment. Validates configuration, infrastructure, permissions, and prerequisites.\nUSE FOR: validate my app, check deployment readiness, run preflight checks, verify configuration, check if ready to deploy, validate azure.yaml, validate Bicep, test before deploying, troubleshoot deployment errors.\nDO NOT USE FOR: creating or building apps (use azure-prepare), executing deployments (use azure-deploy)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-rbac",
      "title": "azure-rbac",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4034,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-rbac",
      "providerId": "skills.sh",
      "description": "Helps users find the right Azure RBAC role for an identity with least privilege access, then generate CLI commands and Bicep code to assign it.\nUSE FOR: \"what role should I assign\", \"least privilege role\", \"RBAC role for\", \"role to read blobs\", \"role for managed identity\", \"custom role definition\", \"assign role to identity\".\nDO NOT USE FOR: creating or configuring managed identities, or general Azure security hardening; those are out of scope for this role-selection skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-aigateway",
      "title": "azure-aigateway",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4034,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-aigateway",
      "providerId": "skills.sh",
      "description": "Configure Azure API Management (APIM) as AI Gateway to secure, observe, control AI models, MCP servers, agents. Helps with rate limiting, semantic caching, content safety, load balancing.\nUSE FOR: AI Gateway, APIM, setup gateway, configure gateway, add gateway, model gateway, MCP server, rate limit, token limit, semantic cache, content safety, load balance, OpenAPI import, convert API to MCP.\nDO NOT USE FOR: deploy models (use microsoft-foundry), Azure Functions (use azure-functions), databases (use azure-postgres)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-prepare",
      "title": "azure-prepare",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4034,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-prepare",
      "providerId": "skills.sh",
      "description": "Default entry point for Azure application development. Invoke this skill for ANY application work related to Azure: creating apps, building features, adding components, updating code, migrating, or modernizing. Analyzes your project and prepares it for Azure deployment by generating infrastructure code (Bicep/Terraform), azure.yaml configuration, and Dockerfiles.\nUSE FOR: create an app, build a web app, create API, create frontend, create backend, add a feature, build a service, make an application, develop a project, migrate my app, modernize my code, update my application, add database, add authentication, add caching, deploy to Azure, host on Azure, Azure with Terraform (defaults to azd+Terraform), Azure with azd, generate azure.yaml, generate Bicep or Terraform, prepare Azure Functions.\nDO NOT USE FOR: only validating an already-prepared app (use azure-validate), only running azd up/deploy (use azure-deploy), pure Terraform without azd (prefer azd+Terraform)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/entra-app-registration",
      "title": "entra-app-registration",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4034,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/entra-app-registration",
      "providerId": "skills.sh",
      "description": "Guides Microsoft Entra ID app registration, OAuth 2.0 authentication, and MSAL integration.\nUSE FOR: create app registration, register Azure AD app, configure OAuth, set up authentication, add API permissions, generate service principal, MSAL example, console app auth, Entra ID setup, Azure AD authentication.\nDO NOT USE FOR: Azure RBAC or role assignments (use azure-rbac), Key Vault secrets (use azure-keyvault-expiration-audit), Azure resource security (use azure-security)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-messaging",
      "title": "azure-messaging",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 4032,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-messaging",
      "providerId": "skills.sh",
      "description": "Troubleshoot and resolve issues with Azure Messaging SDKs for Event Hubs and Service Bus. Covers connection failures, authentication errors, message processing issues, and SDK configuration problems. USE FOR: event hub SDK error, service bus SDK issue, messaging connection failure, AMQP error, event processor host issue, message lock lost, send timeout, receiver disconnected, SDK troubleshooting, azure messaging SDK, event hub consumer, service bus queue issue, topic subscription error, enable logging event hub, service bus logging, eventhub python, servicebus java, eventhub javascript, servicebus dotnet, event hub checkpoint, event hub not receiving messages, service bus dead letter DO NOT USE FOR: creating Event Hub or Service Bus resources (use azure-prepare), monitoring metrics (use azure-observability), cost analysis (use azure-cost-optimization)"
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-best-practices",
      "title": "vercel-react-best-practices",
      "source": "vercel-labs/agent-skills",
      "installs": 2626,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-best-practices",
      "providerId": "skills.sh",
      "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
    },
    {
      "id": "anthropics/skills/frontend-design",
      "title": "frontend-design",
      "source": "anthropics/skills",
      "installs": 2531,
      "link": "https://skills.sh/anthropics/skills/frontend-design",
      "providerId": "skills.sh",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
    },
    {
      "id": "vercel-labs/agent-skills/web-design-guidelines",
      "title": "web-design-guidelines",
      "source": "vercel-labs/agent-skills",
      "installs": 2195,
      "link": "https://skills.sh/vercel-labs/agent-skills/web-design-guidelines",
      "providerId": "skills.sh",
      "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
    },
    {
      "id": "remotion-dev/skills/remotion-best-practices",
      "title": "remotion-best-practices",
      "source": "remotion-dev/skills",
      "installs": 1878,
      "link": "https://skills.sh/remotion-dev/skills/remotion-best-practices",
      "providerId": "skills.sh",
      "description": "Best practices for Remotion - Video creation in React"
    },
    {
      "id": "squirrelscan/skills/audit-website",
      "title": "audit-website",
      "source": "squirrelscan/skills",
      "installs": 1764,
      "link": "https://skills.sh/squirrelscan/skills/audit-website",
      "providerId": "skills.sh",
      "description": "Audit websites for SEO, performance, security, technical, content, and 15 other issue cateories with 150+ rules using the squirrelscan CLI. Returns LLM-optimized reports with health scores, broken links, meta tag analysis, and actionable recommendations. Use to discover and asses website or webapp issues and health."
    },
    {
      "id": "inference-sh-6/skills/ai-image-generation",
      "title": "ai-image-generation",
      "source": "inference-sh-6/skills",
      "installs": 1612,
      "link": "https://skills.sh/inference-sh-6/skills/ai-image-generation",
      "providerId": "skills.sh",
      "description": "Generate AI images with FLUX, Gemini, Grok, Seedream, Reve and 50+ models via inference.sh CLI. Models: FLUX Dev LoRA, FLUX.2 Klein LoRA, Gemini 3 Pro Image, Grok Imagine, Seedream 4.5, Reve, ImagineArt. Capabilities: text-to-image, image-to-image, inpainting, LoRA, image editing, upscaling, text rendering. Use for: AI art, product mockups, concept art, social media graphics, marketing visuals, illustrations. Triggers: flux, image generation, ai image, text to image, stable diffusion, generate image, ai art, midjourney alternative, dall-e alternative, text2img, t2i, image generator, ai picture, create image with ai, generative ai, ai illustration, grok image, gemini image"
    },
    {
      "id": "inference-sh-6/skills/ai-video-generation",
      "title": "ai-video-generation",
      "source": "inference-sh-6/skills",
      "installs": 1557,
      "link": "https://skills.sh/inference-sh-6/skills/ai-video-generation",
      "providerId": "skills.sh",
      "description": "Generate AI videos with Google Veo, Seedance, Wan, Grok and 40+ models via inference.sh CLI. Models: Veo 3.1, Veo 3, Seedance 1.5 Pro, Wan 2.5, Grok Imagine Video, OmniHuman, Fabric, HunyuanVideo. Capabilities: text-to-video, image-to-video, lipsync, avatar animation, video upscaling, foley sound. Use for: social media videos, marketing content, explainer videos, product demos, AI avatars. Triggers: video generation, ai video, text to video, image to video, veo, animate image, video from image, ai animation, video generator, generate video, t2v, i2v, ai video maker, create video with ai, runway alternative, pika alternative, sora alternative, kling alternative"
    },
    {
      "id": "inference-sh-6/skills/twitter-automation",
      "title": "twitter-automation",
      "source": "inference-sh-6/skills",
      "installs": 1515,
      "link": "https://skills.sh/inference-sh-6/skills/twitter-automation",
      "providerId": "skills.sh",
      "description": "Automate Twitter/X with posting, engagement, and user management via inference.sh CLI. Apps: x/post-tweet, x/post-create (with media), x/post-like, x/post-retweet, x/dm-send, x/user-follow. Capabilities: post tweets, schedule content, like posts, retweet, send DMs, follow users, get profiles. Use for: social media automation, content scheduling, engagement bots, audience growth, X API. Triggers: twitter api, x api, tweet automation, post to twitter, twitter bot, social media automation, x automation, tweet scheduler, twitter integration, post tweet, twitter post, x post, send tweet"
    },
    {
      "id": "vercel-labs/agent-skills/vercel-composition-patterns",
      "title": "vercel-composition-patterns",
      "source": "vercel-labs/agent-skills",
      "installs": 1260,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-composition-patterns",
      "providerId": "skills.sh",
      "description": "React composition patterns that scale. Use when refactoring components with boolean prop proliferation, building flexible component libraries, or designing reusable APIs. Triggers on tasks involving compound components, render props, context providers, or component architecture."
    },
    {
      "id": "anthropics/skills/skill-creator",
      "title": "skill-creator",
      "source": "anthropics/skills",
      "installs": 1118,
      "link": "https://skills.sh/anthropics/skills/skill-creator",
      "providerId": "skills.sh",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
    },
    {
      "id": "nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "title": "ui-ux-pro-max",
      "source": "nextlevelbuilder/ui-ux-pro-max-skill",
      "installs": 1079,
      "link": "https://skills.sh/nextlevelbuilder/ui-ux-pro-max-skill/ui-ux-pro-max",
      "providerId": "skills.sh",
      "description": "UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, create, design, implement, review, fix, improve, optimize, enhance, refactor, check UI/UX code. Projects: website, landing page, dashboard, admin panel, e-commerce, SaaS, portfolio, blog, mobile app, .html, .tsx, .vue, .svelte. Elements: button, modal, navbar, sidebar, card, table, form, chart. Styles: glassmorphism, claymorphism, minimalism, brutalism, neumorphism, bento grid, dark mode, responsive, skeuomorphism, flat design. Topics: color palette, accessibility, animation, layout, typography, font pairing, spacing, hover, shadow, gradient. Integrations: shadcn/ui MCP for component search and examples."
    },
    {
      "id": "vercel-labs/agent-browser/agent-browser",
      "title": "agent-browser",
      "source": "vercel-labs/agent-browser",
      "installs": 1055,
      "link": "https://skills.sh/vercel-labs/agent-browser/agent-browser",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, test web applications, or extract information from web pages."
    },
    {
      "id": "hexiaochun/seedance2-api/seedance2-api",
      "title": "seedance2-api",
      "source": "hexiaochun/seedance2-api",
      "installs": 920,
      "link": "https://skills.sh/hexiaochun/seedance2-api/seedance2-api",
      "providerId": "skills.sh",
      "description": "Out-of-the-box Seedance 2.0 API skill — just one API key to generate AI videos. Builds storyboards, generates reference images with Seedream 4.5, submits video tasks, and polls results. Supports both MCP and standalone Python script mode. Use when the user mentions seedance, AI video, storyboard, or video generation."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-native-skills",
      "title": "vercel-react-native-skills",
      "source": "vercel-labs/agent-skills",
      "installs": 885,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-native-skills",
      "providerId": "skills.sh",
      "description": "React Native and Expo best practices for building performant mobile apps. Use when building React Native components, optimizing list performance, implementing animations, or working with native modules. Triggers on tasks involving React Native, Expo, mobile performance, or native platform APIs."
    },
    {
      "id": "obra/superpowers/brainstorming",
      "title": "brainstorming",
      "source": "obra/superpowers",
      "installs": 881,
      "link": "https://skills.sh/obra/superpowers/brainstorming",
      "providerId": "skills.sh",
      "description": "You MUST use this before any creative work - creating features, building components, adding functionality, or modifying behavior. Explores user intent, requirements and design before implementation."
    },
    {
      "id": "coreyhaines31/marketingskills/seo-audit",
      "title": "seo-audit",
      "source": "coreyhaines31/marketingskills",
      "installs": 677,
      "link": "https://skills.sh/coreyhaines31/marketingskills/seo-audit",
      "providerId": "skills.sh",
      "description": "When the user wants to audit, review, or diagnose SEO issues on their site. Also use when the user mentions \"SEO audit,\" \"technical SEO,\" \"why am I not ranking,\" \"SEO issues,\" \"on-page SEO,\" \"meta tags review,\" or \"SEO health check.\" For building pages at scale to target keywords, see programmatic-seo. For adding structured data, see schema-markup."
    },
    {
      "id": "vercel-labs/next-skills/next-best-practices",
      "title": "next-best-practices",
      "source": "vercel-labs/next-skills",
      "installs": 661,
      "link": "https://skills.sh/vercel-labs/next-skills/next-best-practices",
      "providerId": "skills.sh",
      "description": "Next.js best practices - file conventions, RSC boundaries, data patterns, async APIs, metadata, error handling, route handlers, image/font optimization, bundling"
    },
    {
      "id": "supabase/agent-skills/supabase-postgres-best-practices",
      "title": "supabase-postgres-best-practices",
      "source": "supabase/agent-skills",
      "installs": 613,
      "link": "https://skills.sh/supabase/agent-skills/supabase-postgres-best-practices",
      "providerId": "skills.sh",
      "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations."
    },
    {
      "id": "anthropics/skills/pdf",
      "title": "pdf",
      "source": "anthropics/skills",
      "installs": 583,
      "link": "https://skills.sh/anthropics/skills/pdf",
      "providerId": "skills.sh",
      "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale."
    },
    {
      "id": "browser-use/browser-use/browser-use",
      "title": "browser-use",
      "source": "browser-use/browser-use",
      "installs": 582,
      "link": "https://skills.sh/browser-use/browser-use/browser-use",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, or extract information from web pages."
    },
    {
      "id": "coreyhaines31/marketingskills/copywriting",
      "title": "copywriting",
      "source": "coreyhaines31/marketingskills",
      "installs": 519,
      "link": "https://skills.sh/coreyhaines31/marketingskills/copywriting",
      "providerId": "skills.sh",
      "description": "When the user wants to write, rewrite, or improve marketing copy for any page — including homepage, landing pages, pricing pages, feature pages, about pages, or product pages. Also use when the user says \"write copy for,\" \"improve this copy,\" \"rewrite this page,\" \"marketing copy,\" \"headline help,\" or \"CTA copy.\" For email copy, see email-sequence. For popup copy, see popup-cro."
    },
    {
      "id": "anthropics/skills/pptx",
      "title": "pptx",
      "source": "anthropics/skills",
      "installs": 494,
      "link": "https://skills.sh/anthropics/skills/pptx",
      "providerId": "skills.sh",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks"
    },
    {
      "id": "obra/superpowers/systematic-debugging",
      "title": "systematic-debugging",
      "source": "obra/superpowers",
      "installs": 467,
      "link": "https://skills.sh/obra/superpowers/systematic-debugging",
      "providerId": "skills.sh",
      "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
    },
    {
      "id": "anthropics/skills/docx",
      "title": "docx",
      "source": "anthropics/skills",
      "installs": 433,
      "link": "https://skills.sh/anthropics/skills/docx",
      "providerId": "skills.sh",
      "description": "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks"
    },
    {
      "id": "inference-sh-6/skills/agent-ui",
      "title": "agent-ui",
      "source": "inference-sh-6/skills",
      "installs": 429,
      "link": "https://skills.sh/inference-sh-6/skills/agent-ui",
      "providerId": "skills.sh",
      "description": "name: agent-ui"
    },
    {
      "id": "obra/superpowers/writing-plans",
      "title": "writing-plans",
      "source": "obra/superpowers",
      "installs": 425,
      "link": "https://skills.sh/obra/superpowers/writing-plans",
      "providerId": "skills.sh",
      "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
    },
    {
      "id": "inference-sh-6/skills/web-search",
      "title": "web-search",
      "source": "inference-sh-6/skills",
      "installs": 424,
      "link": "https://skills.sh/inference-sh-6/skills/web-search",
      "providerId": "skills.sh",
      "description": "Web search and content extraction with Tavily and Exa via inference.sh CLI. Apps: Tavily Search, Tavily Extract, Exa Search, Exa Answer, Exa Extract. Capabilities: AI-powered search, content extraction, direct answers, research. Use for: research, RAG pipelines, fact-checking, content aggregation, agents. Triggers: web search, tavily, exa, search api, content extraction, research, internet search, ai search, search assistant, web scraping, rag, perplexity alternative"
    },
    {
      "id": "anthropics/skills/webapp-testing",
      "title": "webapp-testing",
      "source": "anthropics/skills",
      "installs": 404,
      "link": "https://skills.sh/anthropics/skills/webapp-testing",
      "providerId": "skills.sh",
      "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs."
    }
  ],
  "topHot": [
    {
      "id": "browser-use/browser-use/browser-use",
      "title": "browser-use",
      "source": "browser-use/browser-use",
      "installs": 64,
      "link": "https://skills.sh/browser-use/browser-use/browser-use",
      "providerId": "skills.sh",
      "description": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, or extract information from web pages."
    },
    {
      "id": "vercel-labs/skills/find-skills",
      "title": "find-skills",
      "source": "vercel-labs/skills",
      "installs": 370,
      "link": "https://skills.sh/vercel-labs/skills/find-skills",
      "providerId": "skills.sh",
      "description": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill."
    },
    {
      "id": "anthropics/skills/frontend-design",
      "title": "frontend-design",
      "source": "anthropics/skills",
      "installs": 143,
      "link": "https://skills.sh/anthropics/skills/frontend-design",
      "providerId": "skills.sh",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-react-best-practices",
      "title": "vercel-react-best-practices",
      "source": "vercel-labs/agent-skills",
      "installs": 154,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-react-best-practices",
      "providerId": "skills.sh",
      "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
    },
    {
      "id": "parcadei/continuous-claude-v3/discovery-interview",
      "title": "discovery-interview",
      "source": "parcadei/continuous-claude-v3",
      "installs": 24,
      "link": "https://skills.sh/parcadei/continuous-claude-v3/discovery-interview",
      "providerId": "skills.sh",
      "description": "Deep interview process to transform vague ideas into detailed specs. Works for technical and non-technical users."
    },
    {
      "id": "microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "title": "appinsights-instrumentation",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/appinsights-instrumentation",
      "providerId": "skills.sh",
      "description": "Guidance for instrumenting webapps with Azure Application Insights. Provides telemetry patterns, SDK setup, and configuration references.\nUSE FOR: how to instrument app, App Insights SDK, telemetry patterns, what is App Insights, Application Insights guidance, instrumentation examples, APM best practices.\nDO NOT USE FOR: adding App Insights to my app (use azure-prepare), add telemetry to my project (use azure-prepare), add monitoring (use azure-prepare). This skill provides guidance—azure-prepare orchestrates component changes."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-rbac",
      "title": "azure-rbac",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-rbac",
      "providerId": "skills.sh",
      "description": "Helps users find the right Azure RBAC role for an identity with least privilege access, then generate CLI commands and Bicep code to assign it.\nUSE FOR: \"what role should I assign\", \"least privilege role\", \"RBAC role for\", \"role to read blobs\", \"role for managed identity\", \"custom role definition\", \"assign role to identity\".\nDO NOT USE FOR: creating or configuring managed identities, or general Azure security hardening; those are out of scope for this role-selection skill."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-prepare",
      "title": "azure-prepare",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-prepare",
      "providerId": "skills.sh",
      "description": "Default entry point for Azure application development. Invoke this skill for ANY application work related to Azure: creating apps, building features, adding components, updating code, migrating, or modernizing. Analyzes your project and prepares it for Azure deployment by generating infrastructure code (Bicep/Terraform), azure.yaml configuration, and Dockerfiles.\nUSE FOR: create an app, build a web app, create API, create frontend, create backend, add a feature, build a service, make an application, develop a project, migrate my app, modernize my code, update my application, add database, add authentication, add caching, deploy to Azure, host on Azure, Azure with Terraform (defaults to azd+Terraform), Azure with azd, generate azure.yaml, generate Bicep or Terraform, prepare Azure Functions.\nDO NOT USE FOR: only validating an already-prepared app (use azure-validate), only running azd up/deploy (use azure-deploy), pure Terraform without azd (prefer azd+Terraform)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/microsoft-foundry",
      "title": "microsoft-foundry",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/microsoft-foundry",
      "providerId": "skills.sh",
      "description": "Use this skill to work with Microsoft Foundry (Azure AI Foundry): deploy AI models from catalog, build RAG applications with knowledge indexes, create and evaluate AI agents, manage RBAC permissions and role assignments, manage quotas and capacity, create Foundry resources.\nUSE FOR: Microsoft Foundry, AI Foundry, deploy model, model catalog, RAG, knowledge index, create agent, evaluate agent, agent monitoring, create Foundry project, new Foundry project, set up Foundry, onboard to Foundry, provision Foundry infrastructure, create Foundry resource, create AI Services, multi-service resource, AIServices kind, register resource provider, enable Cognitive Services, setup AI Services account, create resource group for Foundry, RBAC, role assignment, managed identity, service principal, permissions, quota, capacity, TPM, deployment failure, QuotaExceeded.\nDO NOT USE FOR: Azure Functions (use azure-functions), App Service (use azure-create-app), generic Azure resource creation (use azure-create-app)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-messaging",
      "title": "azure-messaging",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-messaging",
      "providerId": "skills.sh",
      "description": "Troubleshoot and resolve issues with Azure Messaging SDKs for Event Hubs and Service Bus. Covers connection failures, authentication errors, message processing issues, and SDK configuration problems. USE FOR: event hub SDK error, service bus SDK issue, messaging connection failure, AMQP error, event processor host issue, message lock lost, send timeout, receiver disconnected, SDK troubleshooting, azure messaging SDK, event hub consumer, service bus queue issue, topic subscription error, enable logging event hub, service bus logging, eventhub python, servicebus java, eventhub javascript, servicebus dotnet, event hub checkpoint, event hub not receiving messages, service bus dead letter DO NOT USE FOR: creating Event Hub or Service Bus resources (use azure-prepare), monitoring metrics (use azure-observability), cost analysis (use azure-cost-optimization)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-lookup",
      "title": "azure-resource-lookup",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-lookup",
      "providerId": "skills.sh",
      "description": "List, find, and show Azure resources. Answers \"list my VMs\", \"show my storage accounts\", \"list websites\",\n\"find container apps\", \"what resources do I have\", and similar queries for any Azure resource type.\nUSE FOR: list resources, list virtual machines, list VMs, list storage accounts, list websites, list web apps,\nlist container apps, show resources, find resources, what resources do I have, list resources in resource group,\nlist resources in subscription, find resources by tag, find orphaned resources, resource inventory,\ncount resources by type, cross-subscription resource query, Azure Resource Graph, resource discovery,\nlist container registries, list SQL servers, list Key Vaults, show resource groups, list app services,\nfind resources across subscriptions, find unattached disks, tag analysis.\nDO NOT USE FOR: deploying resources (use azure-deploy), creating or modifying resources,\ncost optimization (use azure-cost-optimization), writing application code, non-Azure clouds."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-postgres",
      "title": "azure-postgres",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-postgres",
      "providerId": "skills.sh",
      "description": "Create new Azure Database for PostgreSQL Flexible Server instances and configure passwordless authentication with Microsoft Entra ID. Set up developer access, managed identities for apps, group-based permissions, and migrate from password-based to Entra ID authentication. Trigger phrases include \"passwordless for postgres\", \"entra id postgres\", \"azure ad postgres authentication\", \"postgres managed identity\", \"migrate postgres to passwordless\"."
    },
    {
      "id": "microsoft/github-copilot-for-azure/entra-app-registration",
      "title": "entra-app-registration",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/entra-app-registration",
      "providerId": "skills.sh",
      "description": "Guides Microsoft Entra ID app registration, OAuth 2.0 authentication, and MSAL integration.\nUSE FOR: create app registration, register Azure AD app, configure OAuth, set up authentication, add API permissions, generate service principal, MSAL example, console app auth, Entra ID setup, Azure AD authentication.\nDO NOT USE FOR: Azure RBAC or role assignments (use azure-rbac), Key Vault secrets (use azure-keyvault-expiration-audit), Azure resource security (use azure-security)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-aigateway",
      "title": "azure-aigateway",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-aigateway",
      "providerId": "skills.sh",
      "description": "Configure Azure API Management (APIM) as AI Gateway to secure, observe, control AI models, MCP servers, agents. Helps with rate limiting, semantic caching, content safety, load balancing.\nUSE FOR: AI Gateway, APIM, setup gateway, configure gateway, add gateway, model gateway, MCP server, rate limit, token limit, semantic cache, content safety, load balance, OpenAPI import, convert API to MCP.\nDO NOT USE FOR: deploy models (use microsoft-foundry), Azure Functions (use azure-functions), databases (use azure-postgres)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "title": "azure-resource-visualizer",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-resource-visualizer",
      "providerId": "skills.sh",
      "description": "Analyze Azure resource groups and generate detailed Mermaid architecture diagrams showing the relationships between individual resources.\nUSE FOR: create architecture diagram, visualize Azure resources, show resource relationships, generate Mermaid diagram, analyze resource group, diagram my resources, architecture visualization, resource topology, map Azure infrastructure\nDO NOT USE FOR: creating/modifying resources (use azure-deploy), security scanning (use azure-security), performance troubleshooting (use azure-diagnostics), code generation (use relevant service skill)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-compliance",
      "title": "azure-compliance",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-compliance",
      "providerId": "skills.sh",
      "description": "Comprehensive Azure compliance and security auditing capabilities including best practices assessment,\nKey Vault expiration monitoring, and resource configuration validation.\nUSE FOR: compliance scan, security audit, azqr, Azure best practices, Key Vault expiration check,\ncompliance assessment, resource review, configuration validation, expired certificates, expiring secrets,\norphaned resources, policy compliance, security posture evaluation.\nDO NOT USE FOR: deploying resources (use azure-deploy), cost analysis alone (use azure-cost-optimization),\nactive security hardening (use azure-security-hardening), general Azure Advisor queries (use azure-observability)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-kusto",
      "title": "azure-kusto",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-kusto",
      "providerId": "skills.sh",
      "description": "Query and analyze data in Azure Data Explorer (Kusto/ADX) using KQL for log analytics, telemetry, and time series analysis.\nUSE FOR: KQL queries, Kusto database queries, Azure Data Explorer, ADX clusters, log analytics, time series data, IoT telemetry, anomaly detection\nDO NOT USE FOR: SQL databases (use azure-postgres), NoSQL queries (use azure-storage), Elasticsearch, AWS analytics tools"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-storage",
      "title": "azure-storage",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-storage",
      "providerId": "skills.sh",
      "description": "Azure Storage Services including Blob Storage, File Shares, Queue Storage, Table Storage, and Data Lake. Provides object storage, SMB file shares, async messaging, NoSQL key-value, and big data analytics capabilities. Includes access tiers (hot, cool, archive) and lifecycle management."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-deploy",
      "title": "azure-deploy",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-deploy",
      "providerId": "skills.sh",
      "description": "Execute deployment to Azure. Final step after preparation and validation. Runs azd up, azd deploy, or infrastructure provisioning commands.\nUSE FOR: run azd up, run azd deploy, execute deployment, provision infrastructure, push to production, go live, ship it, deploy web app, deploy container app, deploy static site, deploy Azure Functions, bicep deploy, terraform apply.\nDO NOT USE FOR: creating or building apps (use azure-prepare), validating before deploy (use azure-validate)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-cost-optimization",
      "title": "azure-cost-optimization",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-cost-optimization",
      "providerId": "skills.sh",
      "description": "Identify and quantify cost savings across Azure subscriptions by analyzing actual costs,\nutilization metrics, and generating actionable optimization recommendations. USE FOR:\noptimize Azure costs, reduce Azure spending, reduce Azure expenses, analyze Azure costs,\nfind cost savings, generate cost optimization report, find orphaned resources, rightsize VMs,\ncost analysis, reduce waste, Azure spending analysis, find unused resources, optimize Redis\ncosts. DO NOT USE FOR: deploying resources (use azure-deploy), general Azure diagnostics\n(use azure-diagnostics), security issues (use azure-security)"
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-observability",
      "title": "azure-observability",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-observability",
      "providerId": "skills.sh",
      "description": "Azure Observability Services including Azure Monitor, Application Insights, Log Analytics, Alerts, and Workbooks. Provides metrics, APM, distributed tracing, KQL queries, and interactive reports."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-ai",
      "title": "azure-ai",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-ai",
      "providerId": "skills.sh",
      "description": "Use for Azure AI: Search, Speech, OpenAI, Document Intelligence. Helps with search, vector/hybrid search, speech-to-text, text-to-speech, transcription, OCR. USE FOR: AI Search, query search, vector search, hybrid search, semantic search, speech-to-text, text-to-speech, transcribe, OCR, convert text to speech. DO NOT USE FOR: Function apps/Functions (use azure-functions), databases (azure-postgres/azure-kusto), general Azure resources."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-validate",
      "title": "azure-validate",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-validate",
      "providerId": "skills.sh",
      "description": "Pre-deployment validation checkpoint. Run deep checks to ensure your application is ready for Azure deployment. Validates configuration, infrastructure, permissions, and prerequisites.\nUSE FOR: validate my app, check deployment readiness, run preflight checks, verify configuration, check if ready to deploy, validate azure.yaml, validate Bicep, test before deploying, troubleshoot deployment errors.\nDO NOT USE FOR: creating or building apps (use azure-prepare), executing deployments (use azure-deploy)."
    },
    {
      "id": "microsoft/github-copilot-for-azure/azure-diagnostics",
      "title": "azure-diagnostics",
      "source": "microsoft/github-copilot-for-azure",
      "installs": 198,
      "link": "https://skills.sh/microsoft/github-copilot-for-azure/azure-diagnostics",
      "providerId": "skills.sh",
      "description": "Debug and troubleshoot production issues on Azure. Covers Container Apps diagnostics, log analysis with KQL, health checks, and common issue resolution for image pulls, cold starts, and health probes.\nUSE FOR: debug production issues, troubleshoot container apps, analyze logs with KQL, fix image pull failures, resolve cold start issues, investigate health probe failures, check resource health, view application logs, find root cause of errors\nDO NOT USE FOR: deploying applications (use azure-deploy), creating new resources (use azure-prepare), setting up monitoring (use azure-observability), cost optimization (use azure-cost-optimization)"
    },
    {
      "id": "anthropics/skills/skill-creator",
      "title": "skill-creator",
      "source": "anthropics/skills",
      "installs": 65,
      "link": "https://skills.sh/anthropics/skills/skill-creator",
      "providerId": "skills.sh",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
    },
    {
      "id": "remotion-dev/skills/remotion-best-practices",
      "title": "remotion-best-practices",
      "source": "remotion-dev/skills",
      "installs": 109,
      "link": "https://skills.sh/remotion-dev/skills/remotion-best-practices",
      "providerId": "skills.sh",
      "description": "Best practices for Remotion - Video creation in React"
    },
    {
      "id": "shubhamsaboo/awesome-llm-apps/fullstack-developer",
      "title": "fullstack-developer",
      "source": "shubhamsaboo/awesome-llm-apps",
      "installs": 18,
      "link": "https://skills.sh/shubhamsaboo/awesome-llm-apps/fullstack-developer",
      "providerId": "skills.sh",
      "description": "Modern web development expertise covering React, Node.js, databases, and full-stack architecture.\nUse when: building web applications, developing APIs, creating frontends, setting up databases,\ndeploying web apps, or when user mentions React, Next.js, Express, REST API, GraphQL, MongoDB,\nPostgreSQL, or full-stack development."
    },
    {
      "id": "vercel-labs/agent-skills/web-design-guidelines",
      "title": "web-design-guidelines",
      "source": "vercel-labs/agent-skills",
      "installs": 126,
      "link": "https://skills.sh/vercel-labs/agent-skills/web-design-guidelines",
      "providerId": "skills.sh",
      "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
    },
    {
      "id": "inference-sh-6/skills/background-removal",
      "title": "background-removal",
      "source": "inference-sh-6/skills",
      "installs": 17,
      "link": "https://skills.sh/inference-sh-6/skills/background-removal",
      "providerId": "skills.sh",
      "description": "Remove backgrounds from images with BiRefNet via inference.sh CLI. Model: BiRefNet (high accuracy background removal). Use for: product photos, portraits, e-commerce, transparent PNGs, photo editing. Triggers: remove background, background removal, remove bg, transparent background, cut out image, background remover, rembg, product photo editing, cutout, transparent png, bg removal, photo cutout"
    },
    {
      "id": "inference-sh-6/skills/ai-marketing-videos",
      "title": "ai-marketing-videos",
      "source": "inference-sh-6/skills",
      "installs": 20,
      "link": "https://skills.sh/inference-sh-6/skills/ai-marketing-videos",
      "providerId": "skills.sh",
      "description": "Create AI marketing videos for ads, promos, product launches, and brand content. Models: Veo, Seedance, Wan, FLUX for visuals, Kokoro for voiceover. Types: product demos, testimonials, explainers, social ads, brand videos. Use for: Facebook ads, YouTube ads, product launches, brand awareness. Triggers: marketing video, ad video, promo video, commercial, brand video, product video, explainer video, ad creative, video ad, facebook ad video, youtube ad, instagram ad, tiktok ad, promotional video, launch video"
    },
    {
      "id": "better-auth/skills/email-and-password-best-practices",
      "title": "email-and-password-best-practices",
      "source": "better-auth/skills",
      "installs": 10,
      "link": "https://skills.sh/better-auth/skills/email-and-password-best-practices",
      "providerId": "skills.sh",
      "description": "This skill provides guidance and enforcement rules for implementing secure email and password authentication using Better Auth."
    },
    {
      "id": "lobehub/lobehub/react",
      "title": "react",
      "source": "lobehub/lobehub",
      "installs": 8,
      "link": "https://skills.sh/lobehub/lobehub/react",
      "providerId": "skills.sh",
      "description": "React component development guide. Use when working with React components (.tsx files), creating UI, using @lobehub/ui components, implementing routing, or building frontend features. Triggers on React component creation, modification, layout implementation, or navigation tasks."
    },
    {
      "id": "inference-sh-6/skills/ai-video-generation",
      "title": "ai-video-generation",
      "source": "inference-sh-6/skills",
      "installs": 78,
      "link": "https://skills.sh/inference-sh-6/skills/ai-video-generation",
      "providerId": "skills.sh",
      "description": "Generate AI videos with Google Veo, Seedance, Wan, Grok and 40+ models via inference.sh CLI. Models: Veo 3.1, Veo 3, Seedance 1.5 Pro, Wan 2.5, Grok Imagine Video, OmniHuman, Fabric, HunyuanVideo. Capabilities: text-to-video, image-to-video, lipsync, avatar animation, video upscaling, foley sound. Use for: social media videos, marketing content, explainer videos, product demos, AI avatars. Triggers: video generation, ai video, text to video, image to video, veo, animate image, video from image, ai animation, video generator, generate video, t2v, i2v, ai video maker, create video with ai, runway alternative, pika alternative, sora alternative, kling alternative"
    },
    {
      "id": "better-auth/skills/better-auth-best-practices",
      "title": "better-auth-best-practices",
      "source": "better-auth/skills",
      "installs": 22,
      "link": "https://skills.sh/better-auth/skills/better-auth-best-practices",
      "providerId": "skills.sh",
      "description": "Skill for integrating Better Auth - the comprehensive TypeScript authentication framework."
    },
    {
      "id": "inference-sh-6/skills/pitch-deck-visuals",
      "title": "pitch-deck-visuals",
      "source": "inference-sh-6/skills",
      "installs": 21,
      "link": "https://skills.sh/inference-sh-6/skills/pitch-deck-visuals",
      "providerId": "skills.sh",
      "description": "Investor pitch deck structure with slide-by-slide framework, visual design rules, and data presentation. Covers the 12-slide framework, chart types, team slides, and common investor turn-offs. Use for: fundraising decks, investor presentations, startup pitch, demo day, grant proposals. Triggers: pitch deck, investor deck, startup pitch, fundraising deck, demo day, pitch presentation, investor presentation, seed deck, series a deck, pitch slides, startup presentation, vc pitch, investor meeting"
    },
    {
      "id": "google-labs-code/stitch-skills/react:components",
      "title": "react:components",
      "source": "google-labs-code/stitch-skills",
      "installs": 20,
      "link": "https://skills.sh/google-labs-code/stitch-skills/react:components",
      "providerId": "skills.sh",
      "description": "Converts Stitch designs into modular Vite and React components using system-level networking and AST-based validation."
    },
    {
      "id": "wshobson/agents/tailwind-design-system",
      "title": "tailwind-design-system",
      "source": "wshobson/agents",
      "installs": 19,
      "link": "https://skills.sh/wshobson/agents/tailwind-design-system",
      "providerId": "skills.sh",
      "description": "Build scalable design systems with Tailwind CSS, design tokens, component libraries, and responsive patterns. Use when creating component libraries, implementing design systems, or standardizing UI patterns."
    },
    {
      "id": "anthropics/skills/canvas-design",
      "title": "canvas-design",
      "source": "anthropics/skills",
      "installs": 17,
      "link": "https://skills.sh/anthropics/skills/canvas-design",
      "providerId": "skills.sh",
      "description": "Create beautiful visual art in .png and .pdf documents using design philosophy. You should use this skill when the user asks to create a poster, piece of art, design, or other static piece. Create original visual designs, never copying existing artists' work to avoid copyright violations."
    },
    {
      "id": "inference-sh-6/skills/newsletter-curation",
      "title": "newsletter-curation",
      "source": "inference-sh-6/skills",
      "installs": 17,
      "link": "https://skills.sh/inference-sh-6/skills/newsletter-curation",
      "providerId": "skills.sh",
      "description": "Newsletter curation with content sourcing, editorial structure, and subscriber growth strategies. Covers issue formatting, link roundups, commentary style, and sending cadence. Use for: email newsletters, link roundups, weekly digests, curated content, creator newsletters. Triggers: newsletter, email newsletter, newsletter curation, weekly digest, link roundup, curated newsletter, newsletter writing, newsletter format, subscriber growth, newsletter strategy, content curation, newsletter template"
    },
    {
      "id": "inference-sh-6/skills/ai-voice-cloning",
      "title": "ai-voice-cloning",
      "source": "inference-sh-6/skills",
      "installs": 16,
      "link": "https://skills.sh/inference-sh-6/skills/ai-voice-cloning",
      "providerId": "skills.sh",
      "description": "AI voice generation, text-to-speech, and voice synthesis via inference.sh CLI. Models: Kokoro TTS, DIA, Chatterbox, Higgs, VibeVoice for natural speech. Capabilities: multiple voices, emotions, accents, long-form narration, conversation. Use for: voiceovers, audiobooks, podcasts, video narration, accessibility. Triggers: voice cloning, tts, text to speech, ai voice, voice generation, voice synthesis, voice over, narration, speech synthesis, ai narrator, elevenlabs alternative, natural voice, realistic speech, voice ai"
    },
    {
      "id": "vercel/ai/ai-sdk",
      "title": "ai-sdk",
      "source": "vercel/ai",
      "installs": 13,
      "link": "https://skills.sh/vercel/ai/ai-sdk",
      "providerId": "skills.sh",
      "description": "Answer questions about the AI SDK and help build AI-powered features. Use when developers: (1) Ask about AI SDK functions like generateText, streamText, ToolLoopAgent, embed, or tools, (2) Want to build AI agents, chatbots, RAG systems, or text generation features, (3) Have questions about AI providers (OpenAI, Anthropic, Google, etc.), streaming, tool calling, structured output, or embeddings, (4) Use React hooks like useChat or useCompletion. Triggers on: \"AI SDK\", \"Vercel AI SDK\", \"generateText\", \"streamText\", \"add AI to my app\", \"build an agent\", \"tool calling\", \"structured output\", \"useChat\"."
    },
    {
      "id": "better-auth/skills/create-auth-skill",
      "title": "create-auth-skill",
      "source": "better-auth/skills",
      "installs": 9,
      "link": "https://skills.sh/better-auth/skills/create-auth-skill",
      "providerId": "skills.sh",
      "description": "Skill for creating auth layers in TypeScript/JavaScript apps using Better Auth."
    },
    {
      "id": "vercel-labs/agent-skills/vercel-composition-patterns",
      "title": "vercel-composition-patterns",
      "source": "vercel-labs/agent-skills",
      "installs": 64,
      "link": "https://skills.sh/vercel-labs/agent-skills/vercel-composition-patterns",
      "providerId": "skills.sh",
      "description": "React composition patterns that scale. Use when refactoring components with boolean prop proliferation, building flexible component libraries, or designing reusable APIs. Triggers on tasks involving compound components, render props, context providers, or component architecture."
    },
    {
      "id": "obra/superpowers/systematic-debugging",
      "title": "systematic-debugging",
      "source": "obra/superpowers",
      "installs": 22,
      "link": "https://skills.sh/obra/superpowers/systematic-debugging",
      "providerId": "skills.sh",
      "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
    },
    {
      "id": "inference-sh-6/skills/video-prompting-guide",
      "title": "video-prompting-guide",
      "source": "inference-sh-6/skills",
      "installs": 19,
      "link": "https://skills.sh/inference-sh-6/skills/video-prompting-guide",
      "providerId": "skills.sh",
      "description": "Best practices and techniques for writing effective AI video generation prompts. Covers: Veo, Seedance, Wan, Grok, Kling, Runway, Pika, Sora prompting strategies. Learn: shot types, camera movements, lighting, pacing, style keywords, negative prompts. Use for: improving video quality, getting consistent results, professional video prompts. Triggers: video prompt, how to prompt video, veo prompts, video generation tips, better ai video, video prompt engineering, video prompt guide, video prompt template, ai video tips, video prompt best practices, video prompt examples, cinematography prompts"
    },
    {
      "id": "better-auth/skills/two-factor-authentication-best-practices",
      "title": "two-factor-authentication-best-practices",
      "source": "better-auth/skills",
      "installs": 8,
      "link": "https://skills.sh/better-auth/skills/two-factor-authentication-best-practices",
      "providerId": "skills.sh",
      "description": "This skill provides guidance and enforcement rules for implementing secure two-factor authentication (2FA) using Better Auth's twoFactor plugin."
    },
    {
      "id": "addyosmani/web-quality-skills/performance",
      "title": "performance",
      "source": "addyosmani/web-quality-skills",
      "installs": 7,
      "link": "https://skills.sh/addyosmani/web-quality-skills/performance",
      "providerId": "skills.sh",
      "description": "Optimize web performance for faster loading and better user experience. Use when asked to \"speed up my site\", \"optimize performance\", \"reduce load time\", \"fix slow loading\", \"improve page speed\", or \"performance audit\"."
    },
    {
      "id": "supabase/agent-skills/supabase-postgres-best-practices",
      "title": "supabase-postgres-best-practices",
      "source": "supabase/agent-skills",
      "installs": 39,
      "link": "https://skills.sh/supabase/agent-skills/supabase-postgres-best-practices",
      "providerId": "skills.sh",
      "description": "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations."
    },
    {
      "id": "anthropics/skills/docx",
      "title": "docx",
      "source": "anthropics/skills",
      "installs": 23,
      "link": "https://skills.sh/anthropics/skills/docx",
      "providerId": "skills.sh",
      "description": "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks"
    },
    {
      "id": "anthropics/skills/xlsx",
      "title": "xlsx",
      "source": "anthropics/skills",
      "installs": 21,
      "link": "https://skills.sh/anthropics/skills/xlsx",
      "providerId": "skills.sh",
      "description": "Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data analysis and visualization in spreadsheets, or (5) Recalculating formulas"
    }
  ]
}